areiter128/USB-PD-BoB/h/mcal/config/MA330048_P33CK_R30_USB_PD_BOB_pinmap.h
// Device Pin #19 is AVDD

// Device Pin #20 is AVss

// Device Pin #7 is MCLR

// Device Pin #14 is RA0
#define FB_IIN2_TRIS    TRISAbits.TRISA0 // GPIO direction register bit
#define FB_IIN2_WR      LATAbits.LATA0 // GPIO port latch register bit
#define FB_IIN2_RD      PORTAbits.RA0 // GPIO port register bit
#define FB_IIN2_ODC     ODCAbits.ODCA0 // GPIO port open drain configuration register bit
#define FB_IIN2_CNPU    CNPUAbits.CNPUA0 // GPIO port pull-up resistor register bit
#define FB_IIN2_CNPD    CNPDAbits.CNPDA0 // GPIO port pull-down resistor register bit
#define FB_IIN2_CNEN0   CNEN0Abits.CNEN0A0 // GPIO port change notification Enable register bit
#define FB_IIN2_CNSTAT  CNSTATAbits.CNSTATA0 // GPIO port change notification Status register bit
#define FB_IIN2_CNEN1   CNEN1Abits.CNEN1A0 // GPIO port change notification Edge Select Enable register bit
#define FB_IIN2_CNF     CNFAbits.CNFA0 // GPIO port change notification flag bit register bit
#define FB_IIN2_SET     { asm volatile ("bset _LATA, #0 \n"); }
#define FB_IIN2_CLEAR   { asm volatile ("bclr _LATA, #0 \n"); }
#define FB_IIN2_TOGGLE  { asm volatile ("btg  _LATA, #0 \n"); }
#define FB_IIN2_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define FB_IIN2_ANSEL   _ANSELA0 // analog/digital pin configuration register bit
#define FB_IIN2_ADCCORE  // index starts from zero, last index indicated shared adC core
#define FB_IIN2_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define FB_IIN2_ADC_AN_INPUT 0   // ANx input pin number
#define FB_IIN2_ADCBUF  ADCBUF0 // ADC buffer register for this input
#define FB_IIN2_ADC_ANIE ADIELbits.IE0
#define FB_IIN2_ADC_ANEIE ADEIELbits.EIEN0
#define FB_IIN2_ADC_IF   _ADCAN0IF // interrupt flag bit
#define FB_IIN2_ADC_IE   _ADCAN0IE // interrupt enable bit
#define FB_IIN2_ADC_IP   _ADCAN0IP // interrupt priority for this analog input
#define FB_IIN2_ADC_RDY  _AN0RDY // ADC buffer ready bit
#define _FB_IIN2_ADC_Interrupt _ADCAN0Interrupt
#define FB_IIN2_INIT_ANALOG	{FB_IIN2_ANSEL = 1; FB_IIN2_WR = PINSTATE_HIGH; FB_IIN2_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define FB_IIN2_INIT_OUTPUT  {FB_IIN2_WR = PINSTATE_LOW; FB_IIN2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define FB_IIN2_INIT_INPUT   {FB_IIN2_WR = PINSTATE_HIGH; FB_IIN2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #15 is RA1
#define PPC_RST2_TRIS    TRISAbits.TRISA1 // GPIO direction register bit
#define PPC_RST2_WR      LATAbits.LATA1 // GPIO port latch register bit
#define PPC_RST2_RD      PORTAbits.RA1 // GPIO port register bit
#define PPC_RST2_ODC     ODCAbits.ODCA1 // GPIO port open drain configuration register bit
#define PPC_RST2_CNPU    CNPUAbits.CNPUA1 // GPIO port pull-up resistor register bit
#define PPC_RST2_CNPD    CNPDAbits.CNPDA1 // GPIO port pull-down resistor register bit
#define PPC_RST2_CNEN0   CNEN0Abits.CNEN0A1 // GPIO port change notification Enable register bit
#define PPC_RST2_CNSTAT  CNSTATAbits.CNSTATA1 // GPIO port change notification Status register bit
#define PPC_RST2_CNEN1   CNEN1Abits.CNEN1A1 // GPIO port change notification Edge Select Enable register bit
#define PPC_RST2_CNF     CNFAbits.CNFA1 // GPIO port change notification flag bit register bit
#define PPC_RST2_SET     { asm volatile ("bset _LATA, #1 \n"); }
#define PPC_RST2_CLEAR   { asm volatile ("bclr _LATA, #1 \n"); }
#define PPC_RST2_TOGGLE  { asm volatile ("btg  _LATA, #1 \n"); }
#define PPC_RST2_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define PPC_RST2_ANSEL   _ANSELA1 // analog/digital pin configuration register bit
#define PPC_RST2_ADCCORE  // index starts from zero, last index indicated shared adC core
#define PPC_RST2_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define PPC_RST2_ADC_AN_INPUT A1   // ANx input pin number
#define PPC_RST2_ADCBUF  ADCBUFA1 // ADC buffer register for this input
#define PPC_RST2_ADC_ANIE ADIEHbits.IEA1
#define PPC_RST2_ADC_ANEIE ADEIEHbits.EIENA1
#define PPC_RST2_ADC_IF   _ADCANA1IF // interrupt flag bit
#define PPC_RST2_ADC_IE   _ADCANA1IE // interrupt enable bit
#define PPC_RST2_ADC_IP   _ADCANA1IP // interrupt priority for this analog input
#define PPC_RST2_ADC_RDY  _ANA1RDY // ADC buffer ready bit
#define _PPC_RST2_ADC_Interrupt _ADCANA1Interrupt
#define PPC_RST2_INIT_ANALOG	{PPC_RST2_ANSEL = 1; PPC_RST2_WR = PINSTATE_HIGH; PPC_RST2_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define PPC_RST2_INIT_OUTPUT  {PPC_RST2_WR = PINSTATE_LOW; PPC_RST2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define PPC_RST2_INIT_INPUT   {PPC_RST2_WR = PINSTATE_HIGH; PPC_RST2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #16 is RA2
#define FB_IOUT2_TRIS    TRISAbits.TRISA2 // GPIO direction register bit
#define FB_IOUT2_WR      LATAbits.LATA2 // GPIO port latch register bit
#define FB_IOUT2_RD      PORTAbits.RA2 // GPIO port register bit
#define FB_IOUT2_ODC     ODCAbits.ODCA2 // GPIO port open drain configuration register bit
#define FB_IOUT2_CNPU    CNPUAbits.CNPUA2 // GPIO port pull-up resistor register bit
#define FB_IOUT2_CNPD    CNPDAbits.CNPDA2 // GPIO port pull-down resistor register bit
#define FB_IOUT2_CNEN0   CNEN0Abits.CNEN0A2 // GPIO port change notification Enable register bit
#define FB_IOUT2_CNSTAT  CNSTATAbits.CNSTATA2 // GPIO port change notification Status register bit
#define FB_IOUT2_CNEN1   CNEN1Abits.CNEN1A2 // GPIO port change notification Edge Select Enable register bit
#define FB_IOUT2_CNF     CNFAbits.CNFA2 // GPIO port change notification flag bit register bit
#define FB_IOUT2_SET     { asm volatile ("bset _LATA, #2 \n"); }
#define FB_IOUT2_CLEAR   { asm volatile ("bclr _LATA, #2 \n"); }
#define FB_IOUT2_TOGGLE  { asm volatile ("btg  _LATA, #2 \n"); }
#define FB_IOUT2_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define FB_IOUT2_ANSEL   _ANSELA2 // analog/digital pin configuration register bit
#define FB_IOUT2_ADCCORE  // index starts from zero, last index indicated shared adC core
#define FB_IOUT2_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define FB_IOUT2_ADC_AN_INPUT 9   // ANx input pin number
#define FB_IOUT2_ADCBUF  ADCBUF9 // ADC buffer register for this input
#define FB_IOUT2_ADC_ANIE ADIELbits.IE9
#define FB_IOUT2_ADC_ANEIE ADEIELbits.EIEN9
#define FB_IOUT2_ADC_IF   _ADCAN9IF // interrupt flag bit
#define FB_IOUT2_ADC_IE   _ADCAN9IE // interrupt enable bit
#define FB_IOUT2_ADC_IP   _ADCAN9IP // interrupt priority for this analog input
#define FB_IOUT2_ADC_RDY  _AN9RDY // ADC buffer ready bit
#define _FB_IOUT2_ADC_Interrupt _ADCAN9Interrupt
#define FB_IOUT2_INIT_ANALOG	{FB_IOUT2_ANSEL = 1; FB_IOUT2_WR = PINSTATE_HIGH; FB_IOUT2_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define FB_IOUT2_INIT_OUTPUT  {FB_IOUT2_WR = PINSTATE_LOW; FB_IOUT2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define FB_IOUT2_INIT_INPUT   {FB_IOUT2_WR = PINSTATE_HIGH; FB_IOUT2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #17 is RA3
#define TESTPOINT_TRIS    TRISAbits.TRISA3 // GPIO direction register bit
#define TESTPOINT_WR      LATAbits.LATA3 // GPIO port latch register bit
#define TESTPOINT_RD      PORTAbits.RA3 // GPIO port register bit
#define TESTPOINT_ODC     ODCAbits.ODCA3 // GPIO port open drain configuration register bit
#define TESTPOINT_CNPU    CNPUAbits.CNPUA3 // GPIO port pull-up resistor register bit
#define TESTPOINT_CNPD    CNPDAbits.CNPDA3 // GPIO port pull-down resistor register bit
#define TESTPOINT_CNEN0   CNEN0Abits.CNEN0A3 // GPIO port change notification Enable register bit
#define TESTPOINT_CNSTAT  CNSTATAbits.CNSTATA3 // GPIO port change notification Status register bit
#define TESTPOINT_CNEN1   CNEN1Abits.CNEN1A3 // GPIO port change notification Edge Select Enable register bit
#define TESTPOINT_CNF     CNFAbits.CNFA3 // GPIO port change notification flag bit register bit
#define TESTPOINT_SET     { asm volatile ("bset _LATA, #3 \n"); }
#define TESTPOINT_CLEAR   { asm volatile ("bclr _LATA, #3 \n"); }
#define TESTPOINT_TOGGLE  { asm volatile ("btg  _LATA, #3 \n"); }
#define TESTPOINT_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define TESTPOINT_ANSEL   _ANSELA3 // analog/digital pin configuration register bit
#define TESTPOINT_ADCCORE  // index starts from zero, last index indicated shared adC core
#define TESTPOINT_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define TESTPOINT_ADC_AN_INPUT 3   // ANx input pin number
#define TESTPOINT_ADCBUF  ADCBUF3 // ADC buffer register for this input
#define TESTPOINT_ADC_ANIE ADIELbits.IE3
#define TESTPOINT_ADC_ANEIE ADEIELbits.EIEN3
#define TESTPOINT_ADC_IF   _ADCAN3IF // interrupt flag bit
#define TESTPOINT_ADC_IE   _ADCAN3IE // interrupt enable bit
#define TESTPOINT_ADC_IP   _ADCAN3IP // interrupt priority for this analog input
#define TESTPOINT_ADC_RDY  _AN3RDY // ADC buffer ready bit
#define _TESTPOINT_ADC_Interrupt _ADCAN3Interrupt
#define TESTPOINT_INIT_ANALOG	{TESTPOINT_ANSEL = 1; TESTPOINT_WR = PINSTATE_HIGH; TESTPOINT_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define TESTPOINT_INIT_OUTPUT  {TESTPOINT_WR = PINSTATE_LOW; TESTPOINT_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define TESTPOINT_INIT_INPUT   {TESTPOINT_WR = PINSTATE_HIGH; TESTPOINT_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #18 is RA4
#define VOUT2_TRIS    TRISAbits.TRISA4 // GPIO direction register bit
#define VOUT2_WR      LATAbits.LATA4 // GPIO port latch register bit
#define VOUT2_RD      PORTAbits.RA4 // GPIO port register bit
#define VOUT2_ODC     ODCAbits.ODCA4 // GPIO port open drain configuration register bit
#define VOUT2_CNPU    CNPUAbits.CNPUA4 // GPIO port pull-up resistor register bit
#define VOUT2_CNPD    CNPDAbits.CNPDA4 // GPIO port pull-down resistor register bit
#define VOUT2_CNEN0   CNEN0Abits.CNEN0A4 // GPIO port change notification Enable register bit
#define VOUT2_CNSTAT  CNSTATAbits.CNSTATA4 // GPIO port change notification Status register bit
#define VOUT2_CNEN1   CNEN1Abits.CNEN1A4 // GPIO port change notification Edge Select Enable register bit
#define VOUT2_CNF     CNFAbits.CNFA4 // GPIO port change notification flag bit register bit
#define VOUT2_SET     { asm volatile ("bset _LATA, #4 \n"); }
#define VOUT2_CLEAR   { asm volatile ("bclr _LATA, #4 \n"); }
#define VOUT2_TOGGLE  { asm volatile ("btg  _LATA, #4 \n"); }
#define VOUT2_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define VOUT2_ANSEL   _ANSELA4 // analog/digital pin configuration register bit
#define VOUT2_ADCCORE  // index starts from zero, last index indicated shared adC core
#define VOUT2_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define VOUT2_ADC_AN_INPUT 4   // ANx input pin number
#define VOUT2_ADCBUF  ADCBUF4 // ADC buffer register for this input
#define VOUT2_ADC_ANIE ADIELbits.IE4
#define VOUT2_ADC_ANEIE ADEIELbits.EIEN4
#define VOUT2_ADC_IF   _ADCAN4IF // interrupt flag bit
#define VOUT2_ADC_IE   _ADCAN4IE // interrupt enable bit
#define VOUT2_ADC_IP   _ADCAN4IP // interrupt priority for this analog input
#define VOUT2_ADC_RDY  _AN4RDY // ADC buffer ready bit
#define _VOUT2_ADC_Interrupt _ADCAN4Interrupt
#define VOUT2_INIT_ANALOG	{VOUT2_ANSEL = 1; VOUT2_WR = PINSTATE_HIGH; VOUT2_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define VOUT2_INIT_OUTPUT  {VOUT2_WR = PINSTATE_LOW; VOUT2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define VOUT2_INIT_INPUT   {VOUT2_WR = PINSTATE_HIGH; VOUT2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #28 is RB0
#define FB_VBAT_TRIS    TRISBbits.TRISB0 // GPIO direction register bit
#define FB_VBAT_WR      LATBbits.LATB0 // GPIO port latch register bit
#define FB_VBAT_RD      PORTBbits.RB0 // GPIO port register bit
#define FB_VBAT_ODC     ODCBbits.ODCB0 // GPIO port open drain configuration register bit
#define FB_VBAT_CNPU    CNPUBbits.CNPUB0 // GPIO port pull-up resistor register bit
#define FB_VBAT_CNPD    CNPDBbits.CNPDB0 // GPIO port pull-down resistor register bit
#define FB_VBAT_CNEN0   CNEN0Bbits.CNEN0B0 // GPIO port change notification Enable register bit
#define FB_VBAT_CNSTAT  CNSTATBbits.CNSTATB0 // GPIO port change notification Status register bit
#define FB_VBAT_CNEN1   CNEN1Bbits.CNEN1B0 // GPIO port change notification Edge Select Enable register bit
#define FB_VBAT_CNF     CNFBbits.CNFB0 // GPIO port change notification flag bit register bit
#define FB_VBAT_RP      32 // Number of Remappable Pin
#define FB_VBAT_SET     { asm volatile ("bset _LATB, #0 \n"); }
#define FB_VBAT_CLEAR   { asm volatile ("bclr _LATB, #0 \n"); }
#define FB_VBAT_TOGGLE  { asm volatile ("btg  _LATB, #0 \n"); }
#define FB_VBAT_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define FB_VBAT_ANSEL   _ANSELB0 // analog/digital pin configuration register bit
#define FB_VBAT_ADCCORE  // index starts from zero, last index indicated shared adC core
#define FB_VBAT_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define FB_VBAT_ADC_AN_INPUT 5   // ANx input pin number
#define FB_VBAT_ADCBUF  ADCBUF5 // ADC buffer register for this input
#define FB_VBAT_ADC_ANIE ADIELbits.IE5
#define FB_VBAT_ADC_ANEIE ADEIELbits.EIEN5
#define FB_VBAT_ADC_IF   _ADCAN5IF // interrupt flag bit
#define FB_VBAT_ADC_IE   _ADCAN5IE // interrupt enable bit
#define FB_VBAT_ADC_IP   _ADCAN5IP // interrupt priority for this analog input
#define FB_VBAT_ADC_RDY  _AN5RDY // ADC buffer ready bit
#define _FB_VBAT_ADC_Interrupt _ADCAN5Interrupt
#define FB_VBAT_INIT_ANALOG	{FB_VBAT_ANSEL = 1; FB_VBAT_WR = PINSTATE_HIGH; FB_VBAT_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define FB_VBAT_INIT_OUTPUT  {FB_VBAT_WR = PINSTATE_LOW; FB_VBAT_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define FB_VBAT_INIT_INPUT   {FB_VBAT_WR = PINSTATE_HIGH; FB_VBAT_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #29 is RB1
#define FB_TEMP1_TRIS    TRISBbits.TRISB1 // GPIO direction register bit
#define FB_TEMP1_WR      LATBbits.LATB1 // GPIO port latch register bit
#define FB_TEMP1_RD      PORTBbits.RB1 // GPIO port register bit
#define FB_TEMP1_ODC     ODCBbits.ODCB1 // GPIO port open drain configuration register bit
#define FB_TEMP1_CNPU    CNPUBbits.CNPUB1 // GPIO port pull-up resistor register bit
#define FB_TEMP1_CNPD    CNPDBbits.CNPDB1 // GPIO port pull-down resistor register bit
#define FB_TEMP1_CNEN0   CNEN0Bbits.CNEN0B1 // GPIO port change notification Enable register bit
#define FB_TEMP1_CNSTAT  CNSTATBbits.CNSTATB1 // GPIO port change notification Status register bit
#define FB_TEMP1_CNEN1   CNEN1Bbits.CNEN1B1 // GPIO port change notification Edge Select Enable register bit
#define FB_TEMP1_CNF     CNFBbits.CNFB1 // GPIO port change notification flag bit register bit
#define FB_TEMP1_RP      33 // Number of Remappable Pin
#define FB_TEMP1_SET     { asm volatile ("bset _LATB, #1 \n"); }
#define FB_TEMP1_CLEAR   { asm volatile ("bclr _LATB, #1 \n"); }
#define FB_TEMP1_TOGGLE  { asm volatile ("btg  _LATB, #1 \n"); }
#define FB_TEMP1_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define FB_TEMP1_ANSEL   _ANSELB1 // analog/digital pin configuration register bit
#define FB_TEMP1_ADCCORE  // index starts from zero, last index indicated shared adC core
#define FB_TEMP1_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define FB_TEMP1_ADC_AN_INPUT 6   // ANx input pin number
#define FB_TEMP1_ADCBUF  ADCBUF6 // ADC buffer register for this input
#define FB_TEMP1_ADC_ANIE ADIELbits.IE6
#define FB_TEMP1_ADC_ANEIE ADEIELbits.EIEN6
#define FB_TEMP1_ADC_IF   _ADCAN6IF // interrupt flag bit
#define FB_TEMP1_ADC_IE   _ADCAN6IE // interrupt enable bit
#define FB_TEMP1_ADC_IP   _ADCAN6IP // interrupt priority for this analog input
#define FB_TEMP1_ADC_RDY  _AN6RDY // ADC buffer ready bit
#define _FB_TEMP1_ADC_Interrupt _ADCAN6Interrupt
#define FB_TEMP1_INIT_ANALOG	{FB_TEMP1_ANSEL = 1; FB_TEMP1_WR = PINSTATE_HIGH; FB_TEMP1_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define FB_TEMP1_INIT_OUTPUT  {FB_TEMP1_WR = PINSTATE_LOW; FB_TEMP1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define FB_TEMP1_INIT_INPUT   {FB_TEMP1_WR = PINSTATE_HIGH; FB_TEMP1_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #61 is RB10
#define PPC_RST1_TRIS    TRISBbits.TRISB10 // GPIO direction register bit
#define PPC_RST1_WR      LATBbits.LATB10 // GPIO port latch register bit
#define PPC_RST1_RD      PORTBbits.RB10 // GPIO port register bit
#define PPC_RST1_ODC     ODCBbits.ODCB10 // GPIO port open drain configuration register bit
#define PPC_RST1_CNPU    CNPUBbits.CNPUB10 // GPIO port pull-up resistor register bit
#define PPC_RST1_CNPD    CNPDBbits.CNPDB10 // GPIO port pull-down resistor register bit
#define PPC_RST1_CNEN0   CNEN0Bbits.CNEN0B10 // GPIO port change notification Enable register bit
#define PPC_RST1_CNSTAT  CNSTATBbits.CNSTATB10 // GPIO port change notification Status register bit
#define PPC_RST1_CNEN1   CNEN1Bbits.CNEN1B10 // GPIO port change notification Edge Select Enable register bit
#define PPC_RST1_CNF     CNFBbits.CNFB10 // GPIO port change notification flag bit register bit
#define PPC_RST1_RP      42 // Number of Remappable Pin
#define PPC_RST1_SET     { asm volatile ("bset _LATB, #10 \n"); }
#define PPC_RST1_CLEAR   { asm volatile ("bclr _LATB, #10 \n"); }
#define PPC_RST1_TOGGLE  { asm volatile ("btg  _LATB, #10 \n"); }
#define PPC_RST1_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define PPC_RST1_INIT_OUTPUT  {PPC_RST1_WR = PINSTATE_LOW; PPC_RST1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define PPC_RST1_INIT_INPUT   {PPC_RST1_WR = PINSTATE_HIGH; PPC_RST1_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define PPC_RST1_PGx_CHANNEL  3 // PWM channel index
#define PPC_RST1_PGx_PER      PG3PER // PWM channel period register
#define PPC_RST1_PGx_PHASE    PG3PHASE // PWM channel phase register
#define PPC_RST1_PGx_DC       PG3DC // PWM channel duty cycle register
#define PPC_RST1_PGx_DCA      PG3DCA// PWM channel duty cycle A register
#define PPC_RST1_PGx_DTH      PG3DTH // PWM channel rising edge dead time register
#define PPC_RST1_PGx_DTL      PG3DTL // PWM channel falling edge dead time register
#define PPC_RST1_PGx_OVRENH   PG3IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define PPC_RST1_PGx_PENH     PG3IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define PPC_RST1_PGxUPDREQ    PG3STATbits.UPDREQ // PWM channel ADC trigger A register
#define PPC_RST1_PGxTRIGA     PG3TRIGA // PWM channel ADC trigger A register
#define PPC_RST1_PGxTRIGB     PG3TRIGB // PWM channel ADC trigger A register
#define PPC_RST1_PGxTRIGC     PG3TRIGC // PWM channel ADC trigger A register
#define PPC_RST1_PWM_IF       _PWM3IF // interrupt flag bit
#define PPC_RST1_PWM_IE       _PWM3IE // interrupt enable bit
#define PPC_RST1_PWM_IP       _PWM3IP // interrupt priority for this analog input
#define _PPC_RST1_PWM_Interrupt _PWM3Interrupt // Interrupt Service Routine name declaration

// Device Pin #62 is RB11
#define HUB_PRTPWR1_TRIS    TRISBbits.TRISB11 // GPIO direction register bit
#define HUB_PRTPWR1_WR      LATBbits.LATB11 // GPIO port latch register bit
#define HUB_PRTPWR1_RD      PORTBbits.RB11 // GPIO port register bit
#define HUB_PRTPWR1_ODC     ODCBbits.ODCB11 // GPIO port open drain configuration register bit
#define HUB_PRTPWR1_CNPU    CNPUBbits.CNPUB11 // GPIO port pull-up resistor register bit
#define HUB_PRTPWR1_CNPD    CNPDBbits.CNPDB11 // GPIO port pull-down resistor register bit
#define HUB_PRTPWR1_CNEN0   CNEN0Bbits.CNEN0B11 // GPIO port change notification Enable register bit
#define HUB_PRTPWR1_CNSTAT  CNSTATBbits.CNSTATB11 // GPIO port change notification Status register bit
#define HUB_PRTPWR1_CNEN1   CNEN1Bbits.CNEN1B11 // GPIO port change notification Edge Select Enable register bit
#define HUB_PRTPWR1_CNF     CNFBbits.CNFB11 // GPIO port change notification flag bit register bit
#define HUB_PRTPWR1_RP      43 // Number of Remappable Pin
#define HUB_PRTPWR1_SET     { asm volatile ("bset _LATB, #11 \n"); }
#define HUB_PRTPWR1_CLEAR   { asm volatile ("bclr _LATB, #11 \n"); }
#define HUB_PRTPWR1_TOGGLE  { asm volatile ("btg  _LATB, #11 \n"); }
#define HUB_PRTPWR1_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define HUB_PRTPWR1_INIT_OUTPUT  {HUB_PRTPWR1_WR = PINSTATE_LOW; HUB_PRTPWR1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define HUB_PRTPWR1_INIT_INPUT   {HUB_PRTPWR1_WR = PINSTATE_HIGH; HUB_PRTPWR1_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define HUB_PRTPWR1_PGx_CHANNEL  3 // PWM channel index
#define HUB_PRTPWR1_PGx_PER      PG3PER // PWM channel period register
#define HUB_PRTPWR1_PGx_PHASE    PG3PHASE // PWM channel phase register
#define HUB_PRTPWR1_PGx_DC       PG3DC // PWM channel duty cycle register
#define HUB_PRTPWR1_PGx_DCA      PG3DCA// PWM channel duty cycle A register
#define HUB_PRTPWR1_PGx_DTH      PG3DTH // PWM channel rising edge dead time register
#define HUB_PRTPWR1_PGx_DTL      PG3DTL // PWM channel falling edge dead time register
#define HUB_PRTPWR1_PGx_OVRENL   PG3IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define HUB_PRTPWR1_PGx_PENL     PG3IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define HUB_PRTPWR1_PGxUPDREQ    PG3STATbits.UPDREQ // PWM channel ADC trigger A register
#define HUB_PRTPWR1_PGxTRIGA     PG3TRIGA // PWM channel ADC trigger A register
#define HUB_PRTPWR1_PGxTRIGB     PG3TRIGB // PWM channel ADC trigger A register
#define HUB_PRTPWR1_PGxTRIGC     PG3TRIGC // PWM channel ADC trigger A register

