areiter128/USB-PD-BoB/h/mcal/config/MA330048_P33CK_R30_USB_PD_BOB_pinmap.h
// Device Pin #63 is RB12
#define BOOSTH2_TRIS    TRISBbits.TRISB12 // GPIO direction register bit
#define BOOSTH2_WR      LATBbits.LATB12 // GPIO port latch register bit
#define BOOSTH2_RD      PORTBbits.RB12 // GPIO port register bit
#define BOOSTH2_ODC     ODCBbits.ODCB12 // GPIO port open drain configuration register bit
#define BOOSTH2_CNPU    CNPUBbits.CNPUB12 // GPIO port pull-up resistor register bit
#define BOOSTH2_CNPD    CNPDBbits.CNPDB12 // GPIO port pull-down resistor register bit
#define BOOSTH2_CNEN0   CNEN0Bbits.CNEN0B12 // GPIO port change notification Enable register bit
#define BOOSTH2_CNSTAT  CNSTATBbits.CNSTATB12 // GPIO port change notification Status register bit
#define BOOSTH2_CNEN1   CNEN1Bbits.CNEN1B12 // GPIO port change notification Edge Select Enable register bit
#define BOOSTH2_CNF     CNFBbits.CNFB12 // GPIO port change notification flag bit register bit
#define BOOSTH2_RP      44 // Number of Remappable Pin
#define BOOSTH2_SET     { asm volatile ("bset _LATB, #12 \n"); }
#define BOOSTH2_CLEAR   { asm volatile ("bclr _LATB, #12 \n"); }
#define BOOSTH2_TOGGLE  { asm volatile ("btg  _LATB, #12 \n"); }
#define BOOSTH2_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define BOOSTH2_INIT_OUTPUT  {BOOSTH2_WR = PINSTATE_LOW; BOOSTH2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define BOOSTH2_INIT_INPUT   {BOOSTH2_WR = PINSTATE_HIGH; BOOSTH2_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define BOOSTH2_PGx_CHANNEL  2 // PWM channel index
#define BOOSTH2_PGx_PER      PG2PER // PWM channel period register
#define BOOSTH2_PGx_PHASE    PG2PHASE // PWM channel phase register
#define BOOSTH2_PGx_DC       PG2DC // PWM channel duty cycle register
#define BOOSTH2_PGx_DCA      PG2DCA// PWM channel duty cycle A register
#define BOOSTH2_PGx_DTH      PG2DTH // PWM channel rising edge dead time register
#define BOOSTH2_PGx_DTL      PG2DTL // PWM channel falling edge dead time register
#define BOOSTH2_PGx_OVRENH   PG2IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define BOOSTH2_PGx_PENH     PG2IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define BOOSTH2_PGxUPDREQ    PG2STATbits.UPDREQ // PWM channel ADC trigger A register
#define BOOSTH2_PGxTRIGA     PG2TRIGA // PWM channel ADC trigger A register
#define BOOSTH2_PGxTRIGB     PG2TRIGB // PWM channel ADC trigger A register
#define BOOSTH2_PGxTRIGC     PG2TRIGC // PWM channel ADC trigger A register
#define BOOSTH2_PWM_IF       _PWM2IF // interrupt flag bit
#define BOOSTH2_PWM_IE       _PWM2IE // interrupt enable bit
#define BOOSTH2_PWM_IP       _PWM2IP // interrupt priority for this analog input
#define _BOOSTH2_PWM_Interrupt _PWM2Interrupt // Interrupt Service Routine name declaration

// Device Pin #64 is RB13
#define POOSTL2_TRIS    TRISBbits.TRISB13 // GPIO direction register bit
#define POOSTL2_WR      LATBbits.LATB13 // GPIO port latch register bit
#define POOSTL2_RD      PORTBbits.RB13 // GPIO port register bit
#define POOSTL2_ODC     ODCBbits.ODCB13 // GPIO port open drain configuration register bit
#define POOSTL2_CNPU    CNPUBbits.CNPUB13 // GPIO port pull-up resistor register bit
#define POOSTL2_CNPD    CNPDBbits.CNPDB13 // GPIO port pull-down resistor register bit
#define POOSTL2_CNEN0   CNEN0Bbits.CNEN0B13 // GPIO port change notification Enable register bit
#define POOSTL2_CNSTAT  CNSTATBbits.CNSTATB13 // GPIO port change notification Status register bit
#define POOSTL2_CNEN1   CNEN1Bbits.CNEN1B13 // GPIO port change notification Edge Select Enable register bit
#define POOSTL2_CNF     CNFBbits.CNFB13 // GPIO port change notification flag bit register bit
#define POOSTL2_RP      45 // Number of Remappable Pin
#define POOSTL2_SET     { asm volatile ("bset _LATB, #13 \n"); }
#define POOSTL2_CLEAR   { asm volatile ("bclr _LATB, #13 \n"); }
#define POOSTL2_TOGGLE  { asm volatile ("btg  _LATB, #13 \n"); }
#define POOSTL2_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define POOSTL2_INIT_OUTPUT  {POOSTL2_WR = PINSTATE_LOW; POOSTL2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define POOSTL2_INIT_INPUT   {POOSTL2_WR = PINSTATE_HIGH; POOSTL2_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define POOSTL2_PGx_CHANNEL  2 // PWM channel index
#define POOSTL2_PGx_PER      PG2PER // PWM channel period register
#define POOSTL2_PGx_PHASE    PG2PHASE // PWM channel phase register
#define POOSTL2_PGx_DC       PG2DC // PWM channel duty cycle register
#define POOSTL2_PGx_DCA      PG2DCA// PWM channel duty cycle A register
#define POOSTL2_PGx_DTH      PG2DTH // PWM channel rising edge dead time register
#define POOSTL2_PGx_DTL      PG2DTL // PWM channel falling edge dead time register
#define POOSTL2_PGx_OVRENL   PG2IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define POOSTL2_PGx_PENL     PG2IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define POOSTL2_PGxUPDREQ    PG2STATbits.UPDREQ // PWM channel ADC trigger A register
#define POOSTL2_PGxTRIGA     PG2TRIGA // PWM channel ADC trigger A register
#define POOSTL2_PGxTRIGB     PG2TRIGB // PWM channel ADC trigger A register
#define POOSTL2_PGxTRIGC     PG2TRIGC // PWM channel ADC trigger A register

// Device Pin #1 is RB14
#define BUCKH2_TRIS    TRISBbits.TRISB14 // GPIO direction register bit
#define BUCKH2_WR      LATBbits.LATB14 // GPIO port latch register bit
#define BUCKH2_RD      PORTBbits.RB14 // GPIO port register bit
#define BUCKH2_ODC     ODCBbits.ODCB14 // GPIO port open drain configuration register bit
#define BUCKH2_CNPU    CNPUBbits.CNPUB14 // GPIO port pull-up resistor register bit
#define BUCKH2_CNPD    CNPDBbits.CNPDB14 // GPIO port pull-down resistor register bit
#define BUCKH2_CNEN0   CNEN0Bbits.CNEN0B14 // GPIO port change notification Enable register bit
#define BUCKH2_CNSTAT  CNSTATBbits.CNSTATB14 // GPIO port change notification Status register bit
#define BUCKH2_CNEN1   CNEN1Bbits.CNEN1B14 // GPIO port change notification Edge Select Enable register bit
#define BUCKH2_CNF     CNFBbits.CNFB14 // GPIO port change notification flag bit register bit
#define BUCKH2_RP      46 // Number of Remappable Pin
#define BUCKH2_SET     { asm volatile ("bset _LATB, #14 \n"); }
#define BUCKH2_CLEAR   { asm volatile ("bclr _LATB, #14 \n"); }
#define BUCKH2_TOGGLE  { asm volatile ("btg  _LATB, #14 \n"); }
#define BUCKH2_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define BUCKH2_INIT_OUTPUT  {BUCKH2_WR = PINSTATE_LOW; BUCKH2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define BUCKH2_INIT_INPUT   {BUCKH2_WR = PINSTATE_HIGH; BUCKH2_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define BUCKH2_PGx_CHANNEL  1 // PWM channel index
#define BUCKH2_PGx_PER      PG1PER // PWM channel period register
#define BUCKH2_PGx_PHASE    PG1PHASE // PWM channel phase register
#define BUCKH2_PGx_DC       PG1DC // PWM channel duty cycle register
#define BUCKH2_PGx_DCA      PG1DCA// PWM channel duty cycle A register
#define BUCKH2_PGx_DTH      PG1DTH // PWM channel rising edge dead time register
#define BUCKH2_PGx_DTL      PG1DTL // PWM channel falling edge dead time register
#define BUCKH2_PGx_OVRENH   PG1IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define BUCKH2_PGx_PENH     PG1IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define BUCKH2_PGxUPDREQ    PG1STATbits.UPDREQ // PWM channel ADC trigger A register
#define BUCKH2_PGxTRIGA     PG1TRIGA // PWM channel ADC trigger A register
#define BUCKH2_PGxTRIGB     PG1TRIGB // PWM channel ADC trigger A register
#define BUCKH2_PGxTRIGC     PG1TRIGC // PWM channel ADC trigger A register
#define BUCKH2_PWM_IF       _PWM1IF // interrupt flag bit
#define BUCKH2_PWM_IE       _PWM1IE // interrupt enable bit
#define BUCKH2_PWM_IP       _PWM1IP // interrupt priority for this analog input
#define _BUCKH2_PWM_Interrupt _PWM1Interrupt // Interrupt Service Routine name declaration

// Device Pin #2 is RB15
#define BUCKL2_TRIS    TRISBbits.TRISB15 // GPIO direction register bit
#define BUCKL2_WR      LATBbits.LATB15 // GPIO port latch register bit
#define BUCKL2_RD      PORTBbits.RB15 // GPIO port register bit
#define BUCKL2_ODC     ODCBbits.ODCB15 // GPIO port open drain configuration register bit
#define BUCKL2_CNPU    CNPUBbits.CNPUB15 // GPIO port pull-up resistor register bit
#define BUCKL2_CNPD    CNPDBbits.CNPDB15 // GPIO port pull-down resistor register bit
#define BUCKL2_CNEN0   CNEN0Bbits.CNEN0B15 // GPIO port change notification Enable register bit
#define BUCKL2_CNSTAT  CNSTATBbits.CNSTATB15 // GPIO port change notification Status register bit
#define BUCKL2_CNEN1   CNEN1Bbits.CNEN1B15 // GPIO port change notification Edge Select Enable register bit
#define BUCKL2_CNF     CNFBbits.CNFB15 // GPIO port change notification flag bit register bit
#define BUCKL2_RP      47 // Number of Remappable Pin
#define BUCKL2_SET     { asm volatile ("bset _LATB, #15 \n"); }
#define BUCKL2_CLEAR   { asm volatile ("bclr _LATB, #15 \n"); }
#define BUCKL2_TOGGLE  { asm volatile ("btg  _LATB, #15 \n"); }
#define BUCKL2_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define BUCKL2_INIT_OUTPUT  {BUCKL2_WR = PINSTATE_LOW; BUCKL2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define BUCKL2_INIT_INPUT   {BUCKL2_WR = PINSTATE_HIGH; BUCKL2_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define BUCKL2_PGx_CHANNEL  1 // PWM channel index
#define BUCKL2_PGx_PER      PG1PER // PWM channel period register
#define BUCKL2_PGx_PHASE    PG1PHASE // PWM channel phase register
#define BUCKL2_PGx_DC       PG1DC // PWM channel duty cycle register
#define BUCKL2_PGx_DCA      PG1DCA// PWM channel duty cycle A register
#define BUCKL2_PGx_DTH      PG1DTH // PWM channel rising edge dead time register
#define BUCKL2_PGx_DTL      PG1DTL // PWM channel falling edge dead time register
#define BUCKL2_PGx_OVRENL   PG1IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define BUCKL2_PGx_PENL     PG1IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define BUCKL2_PGxUPDREQ    PG1STATbits.UPDREQ // PWM channel ADC trigger A register
#define BUCKL2_PGxTRIGA     PG1TRIGA // PWM channel ADC trigger A register
#define BUCKL2_PGxTRIGB     PG1TRIGB // PWM channel ADC trigger A register
#define BUCKL2_PGxTRIGC     PG1TRIGC // PWM channel ADC trigger A register

// Device Pin #33 is RB2
#define FB_IIN1_TRIS    TRISBbits.TRISB2 // GPIO direction register bit
#define FB_IIN1_WR      LATBbits.LATB2 // GPIO port latch register bit
#define FB_IIN1_RD      PORTBbits.RB2 // GPIO port register bit
#define FB_IIN1_ODC     ODCBbits.ODCB2 // GPIO port open drain configuration register bit
#define FB_IIN1_CNPU    CNPUBbits.CNPUB2 // GPIO port pull-up resistor register bit
#define FB_IIN1_CNPD    CNPDBbits.CNPDB2 // GPIO port pull-down resistor register bit
#define FB_IIN1_CNEN0   CNEN0Bbits.CNEN0B2 // GPIO port change notification Enable register bit
#define FB_IIN1_CNSTAT  CNSTATBbits.CNSTATB2 // GPIO port change notification Status register bit
#define FB_IIN1_CNEN1   CNEN1Bbits.CNEN1B2 // GPIO port change notification Edge Select Enable register bit
#define FB_IIN1_CNF     CNFBbits.CNFB2 // GPIO port change notification flag bit register bit
#define FB_IIN1_RP      34 // Number of Remappable Pin
#define FB_IIN1_SET     { asm volatile ("bset _LATB, #2 \n"); }
#define FB_IIN1_CLEAR   { asm volatile ("bclr _LATB, #2 \n"); }
#define FB_IIN1_TOGGLE  { asm volatile ("btg  _LATB, #2 \n"); }
#define FB_IIN1_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define FB_IIN1_ANSEL   _ANSELB2 // analog/digital pin configuration register bit
#define FB_IIN1_ADCCORE  // index starts from zero, last index indicated shared adC core
#define FB_IIN1_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define FB_IIN1_ADC_AN_INPUT A0   // ANx input pin number
#define FB_IIN1_ADCBUF  ADCBUFA0 // ADC buffer register for this input
#define FB_IIN1_ADC_ANIE ADIEHbits.IEA0
#define FB_IIN1_ADC_ANEIE ADEIEHbits.EIENA0
#define FB_IIN1_ADC_IF   _ADCANA0IF // interrupt flag bit
#define FB_IIN1_ADC_IE   _ADCANA0IE // interrupt enable bit
#define FB_IIN1_ADC_IP   _ADCANA0IP // interrupt priority for this analog input
#define FB_IIN1_ADC_RDY  _ANA0RDY // ADC buffer ready bit
#define _FB_IIN1_ADC_Interrupt _ADCANA0Interrupt
#define FB_IIN1_INIT_ANALOG	{FB_IIN1_ANSEL = 1; FB_IIN1_WR = PINSTATE_HIGH; FB_IIN1_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define FB_IIN1_INIT_OUTPUT  {FB_IIN1_WR = PINSTATE_LOW; FB_IIN1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define FB_IIN1_INIT_INPUT   {FB_IIN1_WR = PINSTATE_HIGH; FB_IIN1_TRIS = PINDIR_INPUT;} // initialization macro for digital input

