areiter128/USB-PD-BoB/h/mcal/config/MA330048_P33CK_R30_USB_PD_BOB_pinmap.h
// Device Pin #34 is RB3
#define PGD2_TRIS    TRISBbits.TRISB3 // GPIO direction register bit
#define PGD2_WR      LATBbits.LATB3 // GPIO port latch register bit
#define PGD2_RD      PORTBbits.RB3 // GPIO port register bit
#define PGD2_ODC     ODCBbits.ODCB3 // GPIO port open drain configuration register bit
#define PGD2_CNPU    CNPUBbits.CNPUB3 // GPIO port pull-up resistor register bit
#define PGD2_CNPD    CNPDBbits.CNPDB3 // GPIO port pull-down resistor register bit
#define PGD2_CNEN0   CNEN0Bbits.CNEN0B3 // GPIO port change notification Enable register bit
#define PGD2_CNSTAT  CNSTATBbits.CNSTATB3 // GPIO port change notification Status register bit
#define PGD2_CNEN1   CNEN1Bbits.CNEN1B3 // GPIO port change notification Edge Select Enable register bit
#define PGD2_CNF     CNFBbits.CNFB3 // GPIO port change notification flag bit register bit
#define PGD2_RP      35 // Number of Remappable Pin
#define PGD2_SET     { asm volatile ("bset _LATB, #3 \n"); }
#define PGD2_CLEAR   { asm volatile ("bclr _LATB, #3 \n"); }
#define PGD2_TOGGLE  { asm volatile ("btg  _LATB, #3 \n"); }
#define PGD2_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define PGD2_ANSEL   _ANSELB3 // analog/digital pin configuration register bit
#define PGD2_ADCCORE  // index starts from zero, last index indicated shared adC core
#define PGD2_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define PGD2_ADC_AN_INPUT 8   // ANx input pin number
#define PGD2_ADCBUF  ADCBUF8 // ADC buffer register for this input
#define PGD2_ADC_ANIE ADIELbits.IE8
#define PGD2_ADC_ANEIE ADEIELbits.EIEN8
#define PGD2_ADC_IF   _ADCAN8IF // interrupt flag bit
#define PGD2_ADC_IE   _ADCAN8IE // interrupt enable bit
#define PGD2_ADC_IP   _ADCAN8IP // interrupt priority for this analog input
#define PGD2_ADC_RDY  _AN8RDY // ADC buffer ready bit
#define _PGD2_ADC_Interrupt _ADCAN8Interrupt
#define PGD2_INIT_ANALOG	{PGD2_ANSEL = 1; PGD2_WR = PINSTATE_HIGH; PGD2_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define PGD2_INIT_OUTPUT  {PGD2_WR = PINSTATE_LOW; PGD2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define PGD2_INIT_INPUT   {PGD2_WR = PINSTATE_HIGH; PGD2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #35 is RB4
#define PGC2_TRIS    TRISBbits.TRISB4 // GPIO direction register bit
#define PGC2_WR      LATBbits.LATB4 // GPIO port latch register bit
#define PGC2_RD      PORTBbits.RB4 // GPIO port register bit
#define PGC2_ODC     ODCBbits.ODCB4 // GPIO port open drain configuration register bit
#define PGC2_CNPU    CNPUBbits.CNPUB4 // GPIO port pull-up resistor register bit
#define PGC2_CNPD    CNPDBbits.CNPDB4 // GPIO port pull-down resistor register bit
#define PGC2_CNEN0   CNEN0Bbits.CNEN0B4 // GPIO port change notification Enable register bit
#define PGC2_CNSTAT  CNSTATBbits.CNSTATB4 // GPIO port change notification Status register bit
#define PGC2_CNEN1   CNEN1Bbits.CNEN1B4 // GPIO port change notification Edge Select Enable register bit
#define PGC2_CNF     CNFBbits.CNFB4 // GPIO port change notification flag bit register bit
#define PGC2_RP      36 // Number of Remappable Pin
#define PGC2_SET     { asm volatile ("bset _LATB, #4 \n"); }
#define PGC2_CLEAR   { asm volatile ("bclr _LATB, #4 \n"); }
#define PGC2_TOGGLE  { asm volatile ("btg  _LATB, #4 \n"); }
#define PGC2_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define PGC2_INIT_OUTPUT  {PGC2_WR = PINSTATE_LOW; PGC2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define PGC2_INIT_INPUT   {PGC2_WR = PINSTATE_HIGH; PGC2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #45 is RB5
#define SDA2_TRIS    TRISBbits.TRISB5 // GPIO direction register bit
#define SDA2_WR      LATBbits.LATB5 // GPIO port latch register bit
#define SDA2_RD      PORTBbits.RB5 // GPIO port register bit
#define SDA2_ODC     ODCBbits.ODCB5 // GPIO port open drain configuration register bit
#define SDA2_CNPU    CNPUBbits.CNPUB5 // GPIO port pull-up resistor register bit
#define SDA2_CNPD    CNPDBbits.CNPDB5 // GPIO port pull-down resistor register bit
#define SDA2_CNEN0   CNEN0Bbits.CNEN0B5 // GPIO port change notification Enable register bit
#define SDA2_CNSTAT  CNSTATBbits.CNSTATB5 // GPIO port change notification Status register bit
#define SDA2_CNEN1   CNEN1Bbits.CNEN1B5 // GPIO port change notification Edge Select Enable register bit
#define SDA2_CNF     CNFBbits.CNFB5 // GPIO port change notification flag bit register bit
#define SDA2_RP      37 // Number of Remappable Pin
#define SDA2_SET     { asm volatile ("bset _LATB, #5 \n"); }
#define SDA2_CLEAR   { asm volatile ("bclr _LATB, #5 \n"); }
#define SDA2_TOGGLE  { asm volatile ("btg  _LATB, #5 \n"); }
#define SDA2_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define SDA2_INIT_OUTPUT  {SDA2_WR = PINSTATE_LOW; SDA2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SDA2_INIT_INPUT   {SDA2_WR = PINSTATE_HIGH; SDA2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #46 is RB6
#define SCL2_TRIS    TRISBbits.TRISB6 // GPIO direction register bit
#define SCL2_WR      LATBbits.LATB6 // GPIO port latch register bit
#define SCL2_RD      PORTBbits.RB6 // GPIO port register bit
#define SCL2_ODC     ODCBbits.ODCB6 // GPIO port open drain configuration register bit
#define SCL2_CNPU    CNPUBbits.CNPUB6 // GPIO port pull-up resistor register bit
#define SCL2_CNPD    CNPDBbits.CNPDB6 // GPIO port pull-down resistor register bit
#define SCL2_CNEN0   CNEN0Bbits.CNEN0B6 // GPIO port change notification Enable register bit
#define SCL2_CNSTAT  CNSTATBbits.CNSTATB6 // GPIO port change notification Status register bit
#define SCL2_CNEN1   CNEN1Bbits.CNEN1B6 // GPIO port change notification Edge Select Enable register bit
#define SCL2_CNF     CNFBbits.CNFB6 // GPIO port change notification flag bit register bit
#define SCL2_RP      38 // Number of Remappable Pin
#define SCL2_SET     { asm volatile ("bset _LATB, #6 \n"); }
#define SCL2_CLEAR   { asm volatile ("bclr _LATB, #6 \n"); }
#define SCL2_TOGGLE  { asm volatile ("btg  _LATB, #6 \n"); }
#define SCL2_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define SCL2_INIT_OUTPUT  {SCL2_WR = PINSTATE_LOW; SCL2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SCL2_INIT_INPUT   {SCL2_WR = PINSTATE_HIGH; SCL2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #47 is RB7
#define SPI_CS1_TRIS    TRISBbits.TRISB7 // GPIO direction register bit
#define SPI_CS1_WR      LATBbits.LATB7 // GPIO port latch register bit
#define SPI_CS1_RD      PORTBbits.RB7 // GPIO port register bit
#define SPI_CS1_ODC     ODCBbits.ODCB7 // GPIO port open drain configuration register bit
#define SPI_CS1_CNPU    CNPUBbits.CNPUB7 // GPIO port pull-up resistor register bit
#define SPI_CS1_CNPD    CNPDBbits.CNPDB7 // GPIO port pull-down resistor register bit
#define SPI_CS1_CNEN0   CNEN0Bbits.CNEN0B7 // GPIO port change notification Enable register bit
#define SPI_CS1_CNSTAT  CNSTATBbits.CNSTATB7 // GPIO port change notification Status register bit
#define SPI_CS1_CNEN1   CNEN1Bbits.CNEN1B7 // GPIO port change notification Edge Select Enable register bit
#define SPI_CS1_CNF     CNFBbits.CNFB7 // GPIO port change notification flag bit register bit
#define SPI_CS1_RP      39 // Number of Remappable Pin
#define SPI_CS1_SET     { asm volatile ("bset _LATB, #7 \n"); }
#define SPI_CS1_CLEAR   { asm volatile ("bclr _LATB, #7 \n"); }
#define SPI_CS1_TOGGLE  { asm volatile ("btg  _LATB, #7 \n"); }
#define SPI_CS1_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define SPI_CS1_ANSEL   _ANSELB7 // analog/digital pin configuration register bit
#define SPI_CS1_ADCCORE  // index starts from zero, last index indicated shared adC core
#define SPI_CS1_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define SPI_CS1_ADC_AN_INPUT 2   // ANx input pin number
#define SPI_CS1_ADCBUF  ADCBUF2 // ADC buffer register for this input
#define SPI_CS1_ADC_ANIE ADIELbits.IE2
#define SPI_CS1_ADC_ANEIE ADEIELbits.EIEN2
#define SPI_CS1_ADC_IF   _ADCAN2IF // interrupt flag bit
#define SPI_CS1_ADC_IE   _ADCAN2IE // interrupt enable bit
#define SPI_CS1_ADC_IP   _ADCAN2IP // interrupt priority for this analog input
#define SPI_CS1_ADC_RDY  _AN2RDY // ADC buffer ready bit
#define _SPI_CS1_ADC_Interrupt _ADCAN2Interrupt
#define SPI_CS1_INIT_ANALOG	{SPI_CS1_ANSEL = 1; SPI_CS1_WR = PINSTATE_HIGH; SPI_CS1_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define SPI_CS1_INIT_OUTPUT  {SPI_CS1_WR = PINSTATE_LOW; SPI_CS1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SPI_CS1_INIT_INPUT   {SPI_CS1_WR = PINSTATE_HIGH; SPI_CS1_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #48 is RB8
#define SCL1_TRIS    TRISBbits.TRISB8 // GPIO direction register bit
#define SCL1_WR      LATBbits.LATB8 // GPIO port latch register bit
#define SCL1_RD      PORTBbits.RB8 // GPIO port register bit
#define SCL1_ODC     ODCBbits.ODCB8 // GPIO port open drain configuration register bit
#define SCL1_CNPU    CNPUBbits.CNPUB8 // GPIO port pull-up resistor register bit
#define SCL1_CNPD    CNPDBbits.CNPDB8 // GPIO port pull-down resistor register bit
#define SCL1_CNEN0   CNEN0Bbits.CNEN0B8 // GPIO port change notification Enable register bit
#define SCL1_CNSTAT  CNSTATBbits.CNSTATB8 // GPIO port change notification Status register bit
#define SCL1_CNEN1   CNEN1Bbits.CNEN1B8 // GPIO port change notification Edge Select Enable register bit
#define SCL1_CNF     CNFBbits.CNFB8 // GPIO port change notification flag bit register bit
#define SCL1_RP      40 // Number of Remappable Pin
#define SCL1_SET     { asm volatile ("bset _LATB, #8 \n"); }
#define SCL1_CLEAR   { asm volatile ("bclr _LATB, #8 \n"); }
#define SCL1_TOGGLE  { asm volatile ("btg  _LATB, #8 \n"); }
#define SCL1_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define SCL1_ANSEL   _ANSELB8 // analog/digital pin configuration register bit
#define SCL1_ADCCORE  // index starts from zero, last index indicated shared adC core
#define SCL1_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define SCL1_ADC_AN_INPUT 10   // ANx input pin number
#define SCL1_ADCBUF  ADCBUF10 // ADC buffer register for this input
#define SCL1_ADC_ANIE ADIELbits.IE10
#define SCL1_ADC_ANEIE ADEIELbits.EIEN10
#define SCL1_ADC_IF   _ADCAN10IF // interrupt flag bit
#define SCL1_ADC_IE   _ADCAN10IE // interrupt enable bit
#define SCL1_ADC_IP   _ADCAN10IP // interrupt priority for this analog input
#define SCL1_ADC_RDY  _AN10RDY // ADC buffer ready bit
#define _SCL1_ADC_Interrupt _ADCAN10Interrupt
#define SCL1_INIT_ANALOG	{SCL1_ANSEL = 1; SCL1_WR = PINSTATE_HIGH; SCL1_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define SCL1_INIT_OUTPUT  {SCL1_WR = PINSTATE_LOW; SCL1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SCL1_INIT_INPUT   {SCL1_WR = PINSTATE_HIGH; SCL1_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #49 is RB9
#define SDA1_TRIS    TRISBbits.TRISB9 // GPIO direction register bit
#define SDA1_WR      LATBbits.LATB9 // GPIO port latch register bit
#define SDA1_RD      PORTBbits.RB9 // GPIO port register bit
#define SDA1_ODC     ODCBbits.ODCB9 // GPIO port open drain configuration register bit
#define SDA1_CNPU    CNPUBbits.CNPUB9 // GPIO port pull-up resistor register bit
#define SDA1_CNPD    CNPDBbits.CNPDB9 // GPIO port pull-down resistor register bit
#define SDA1_CNEN0   CNEN0Bbits.CNEN0B9 // GPIO port change notification Enable register bit
#define SDA1_CNSTAT  CNSTATBbits.CNSTATB9 // GPIO port change notification Status register bit
#define SDA1_CNEN1   CNEN1Bbits.CNEN1B9 // GPIO port change notification Edge Select Enable register bit
#define SDA1_CNF     CNFBbits.CNFB9 // GPIO port change notification flag bit register bit
#define SDA1_RP      41 // Number of Remappable Pin
#define SDA1_SET     { asm volatile ("bset _LATB, #9 \n"); }
#define SDA1_CLEAR   { asm volatile ("bclr _LATB, #9 \n"); }
#define SDA1_TOGGLE  { asm volatile ("btg  _LATB, #9 \n"); }
#define SDA1_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define SDA1_ANSEL   _ANSELB9 // analog/digital pin configuration register bit
#define SDA1_ADCCORE  // index starts from zero, last index indicated shared adC core
#define SDA1_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define SDA1_ADC_AN_INPUT 11   // ANx input pin number
#define SDA1_ADCBUF  ADCBUF11 // ADC buffer register for this input
#define SDA1_ADC_ANIE ADIELbits.IE11
#define SDA1_ADC_ANEIE ADEIELbits.EIEN11
#define SDA1_ADC_IF   _ADCAN11IF // interrupt flag bit
#define SDA1_ADC_IE   _ADCAN11IE // interrupt enable bit
#define SDA1_ADC_IP   _ADCAN11IP // interrupt priority for this analog input
#define SDA1_ADC_RDY  _AN11RDY // ADC buffer ready bit
#define _SDA1_ADC_Interrupt _ADCAN11Interrupt
#define SDA1_INIT_ANALOG	{SDA1_ANSEL = 1; SDA1_WR = PINSTATE_HIGH; SDA1_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define SDA1_INIT_OUTPUT  {SDA1_WR = PINSTATE_LOW; SDA1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SDA1_INIT_INPUT   {SDA1_WR = PINSTATE_HIGH; SDA1_TRIS = PINDIR_INPUT;} // initialization macro for digital input

