areiter128/USB-PD-BoB/h/mcal/config/MA330048_P33CK_R30_USB_PD_BOB_pinmap.h
// Device Pin #13 is RC0
#define PPC_IRQ2_TRIS    TRISCbits.TRISC0 // GPIO direction register bit
#define PPC_IRQ2_WR      LATCbits.LATC0 // GPIO port latch register bit
#define PPC_IRQ2_RD      PORTCbits.RC0 // GPIO port register bit
#define PPC_IRQ2_ODC     ODCCbits.ODCC0 // GPIO port open drain configuration register bit
#define PPC_IRQ2_CNPU    CNPUCbits.CNPUC0 // GPIO port pull-up resistor register bit
#define PPC_IRQ2_CNPD    CNPDCbits.CNPDC0 // GPIO port pull-down resistor register bit
#define PPC_IRQ2_CNEN0   CNEN0Cbits.CNEN0C0 // GPIO port change notification Enable register bit
#define PPC_IRQ2_CNSTAT  CNSTATCbits.CNSTATC0 // GPIO port change notification Status register bit
#define PPC_IRQ2_CNEN1   CNEN1Cbits.CNEN1C0 // GPIO port change notification Edge Select Enable register bit
#define PPC_IRQ2_CNF     CNFCbits.CNFC0 // GPIO port change notification flag bit register bit
#define PPC_IRQ2_RP      48 // Number of Remappable Pin
#define PPC_IRQ2_SET     { asm volatile ("bset _LATC, #0 \n"); }
#define PPC_IRQ2_CLEAR   { asm volatile ("bclr _LATC, #0 \n"); }
#define PPC_IRQ2_TOGGLE  { asm volatile ("btg  _LATC, #0 \n"); }
#define PPC_IRQ2_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define PPC_IRQ2_ANSEL   _ANSELC0 // analog/digital pin configuration register bit
#define PPC_IRQ2_ADCCORE  // index starts from zero, last index indicated shared adC core
#define PPC_IRQ2_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define PPC_IRQ2_ADC_AN_INPUT N0   // ANx input pin number
#define PPC_IRQ2_ADCBUF  ADCBUFN0 // ADC buffer register for this input
#define PPC_IRQ2_ADC_ANIE ADIEHbits.IEN0
#define PPC_IRQ2_ADC_ANEIE ADEIEHbits.EIENN0
#define PPC_IRQ2_ADC_IF   _ADCANN0IF // interrupt flag bit
#define PPC_IRQ2_ADC_IE   _ADCANN0IE // interrupt enable bit
#define PPC_IRQ2_ADC_IP   _ADCANN0IP // interrupt priority for this analog input
#define PPC_IRQ2_ADC_RDY  _ANN0RDY // ADC buffer ready bit
#define _PPC_IRQ2_ADC_Interrupt _ADCANN0Interrupt
#define PPC_IRQ2_INIT_ANALOG	{PPC_IRQ2_ANSEL = 1; PPC_IRQ2_WR = PINSTATE_HIGH; PPC_IRQ2_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define PPC_IRQ2_INIT_OUTPUT  {PPC_IRQ2_WR = PINSTATE_LOW; PPC_IRQ2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define PPC_IRQ2_INIT_INPUT   {PPC_IRQ2_WR = PINSTATE_HIGH; PPC_IRQ2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #22 is RC1
#define ECP18_TRIS    TRISCbits.TRISC1 // GPIO direction register bit
#define ECP18_WR      LATCbits.LATC1 // GPIO port latch register bit
#define ECP18_RD      PORTCbits.RC1 // GPIO port register bit
#define ECP18_ODC     ODCCbits.ODCC1 // GPIO port open drain configuration register bit
#define ECP18_CNPU    CNPUCbits.CNPUC1 // GPIO port pull-up resistor register bit
#define ECP18_CNPD    CNPDCbits.CNPDC1 // GPIO port pull-down resistor register bit
#define ECP18_CNEN0   CNEN0Cbits.CNEN0C1 // GPIO port change notification Enable register bit
#define ECP18_CNSTAT  CNSTATCbits.CNSTATC1 // GPIO port change notification Status register bit
#define ECP18_CNEN1   CNEN1Cbits.CNEN1C1 // GPIO port change notification Edge Select Enable register bit
#define ECP18_CNF     CNFCbits.CNFC1 // GPIO port change notification flag bit register bit
#define ECP18_RP      49 // Number of Remappable Pin
#define ECP18_SET     { asm volatile ("bset _LATC, #1 \n"); }
#define ECP18_CLEAR   { asm volatile ("bclr _LATC, #1 \n"); }
#define ECP18_TOGGLE  { asm volatile ("btg  _LATC, #1 \n"); }
#define ECP18_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define ECP18_ANSEL   _ANSELC1 // analog/digital pin configuration register bit
#define ECP18_ADCCORE  // index starts from zero, last index indicated shared adC core
#define ECP18_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP18_ADC_AN_INPUT 13   // ANx input pin number
#define ECP18_ADCBUF  ADCBUF13 // ADC buffer register for this input
#define ECP18_ADC_ANIE ADIELbits.IE13
#define ECP18_ADC_ANEIE ADEIELbits.EIEN13
#define ECP18_ADC_IF   _ADCAN13IF // interrupt flag bit
#define ECP18_ADC_IE   _ADCAN13IE // interrupt enable bit
#define ECP18_ADC_IP   _ADCAN13IP // interrupt priority for this analog input
#define ECP18_ADC_RDY  _AN13RDY // ADC buffer ready bit
#define _ECP18_ADC_Interrupt _ADCAN13Interrupt
#define ECP18_INIT_ANALOG	{ECP18_ANSEL = 1; ECP18_WR = PINSTATE_HIGH; ECP18_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP18_INIT_OUTPUT  {ECP18_WR = PINSTATE_LOW; ECP18_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP18_INIT_INPUT   {ECP18_WR = PINSTATE_HIGH; ECP18_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #52 is RC10
#define BOOSTH1_TRIS    TRISCbits.TRISC10 // GPIO direction register bit
#define BOOSTH1_WR      LATCbits.LATC10 // GPIO port latch register bit
#define BOOSTH1_RD      PORTCbits.RC10 // GPIO port register bit
#define BOOSTH1_ODC     ODCCbits.ODCC10 // GPIO port open drain configuration register bit
#define BOOSTH1_CNPU    CNPUCbits.CNPUC10 // GPIO port pull-up resistor register bit
#define BOOSTH1_CNPD    CNPDCbits.CNPDC10 // GPIO port pull-down resistor register bit
#define BOOSTH1_CNEN0   CNEN0Cbits.CNEN0C10 // GPIO port change notification Enable register bit
#define BOOSTH1_CNSTAT  CNSTATCbits.CNSTATC10 // GPIO port change notification Status register bit
#define BOOSTH1_CNEN1   CNEN1Cbits.CNEN1C10 // GPIO port change notification Edge Select Enable register bit
#define BOOSTH1_CNF     CNFCbits.CNFC10 // GPIO port change notification flag bit register bit
#define BOOSTH1_RP      58 // Number of Remappable Pin
#define BOOSTH1_SET     { asm volatile ("bset _LATC, #10 \n"); }
#define BOOSTH1_CLEAR   { asm volatile ("bclr _LATC, #10 \n"); }
#define BOOSTH1_TOGGLE  { asm volatile ("btg  _LATC, #10 \n"); }
#define BOOSTH1_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define BOOSTH1_INIT_OUTPUT  {BOOSTH1_WR = PINSTATE_LOW; BOOSTH1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define BOOSTH1_INIT_INPUT   {BOOSTH1_WR = PINSTATE_HIGH; BOOSTH1_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define BOOSTH1_PGx_CHANNEL  7 // PWM channel index
#define BOOSTH1_PGx_PER      PG7PER // PWM channel period register
#define BOOSTH1_PGx_PHASE    PG7PHASE // PWM channel phase register
#define BOOSTH1_PGx_DC       PG7DC // PWM channel duty cycle register
#define BOOSTH1_PGx_DCA      PG7DCA// PWM channel duty cycle A register
#define BOOSTH1_PGx_DTH      PG7DTH // PWM channel rising edge dead time register
#define BOOSTH1_PGx_DTL      PG7DTL // PWM channel falling edge dead time register
#define BOOSTH1_PGx_OVRENH   PG7IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define BOOSTH1_PGx_PENH     PG7IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define BOOSTH1_PGxUPDREQ    PG7STATbits.UPDREQ // PWM channel ADC trigger A register
#define BOOSTH1_PGxTRIGA     PG7TRIGA // PWM channel ADC trigger A register
#define BOOSTH1_PGxTRIGB     PG7TRIGB // PWM channel ADC trigger A register
#define BOOSTH1_PGxTRIGC     PG7TRIGC // PWM channel ADC trigger A register
#define BOOSTH1_PWM_IF       _PWM7IF // interrupt flag bit
#define BOOSTH1_PWM_IE       _PWM7IE // interrupt enable bit
#define BOOSTH1_PWM_IP       _PWM7IP // interrupt priority for this analog input
#define _BOOSTH1_PWM_Interrupt _PWM7Interrupt // Interrupt Service Routine name declaration

// Device Pin #53 is RC11
#define BOOSTL1_TRIS    TRISCbits.TRISC11 // GPIO direction register bit
#define BOOSTL1_WR      LATCbits.LATC11 // GPIO port latch register bit
#define BOOSTL1_RD      PORTCbits.RC11 // GPIO port register bit
#define BOOSTL1_ODC     ODCCbits.ODCC11 // GPIO port open drain configuration register bit
#define BOOSTL1_CNPU    CNPUCbits.CNPUC11 // GPIO port pull-up resistor register bit
#define BOOSTL1_CNPD    CNPDCbits.CNPDC11 // GPIO port pull-down resistor register bit
#define BOOSTL1_CNEN0   CNEN0Cbits.CNEN0C11 // GPIO port change notification Enable register bit
#define BOOSTL1_CNSTAT  CNSTATCbits.CNSTATC11 // GPIO port change notification Status register bit
#define BOOSTL1_CNEN1   CNEN1Cbits.CNEN1C11 // GPIO port change notification Edge Select Enable register bit
#define BOOSTL1_CNF     CNFCbits.CNFC11 // GPIO port change notification flag bit register bit
#define BOOSTL1_RP      59 // Number of Remappable Pin
#define BOOSTL1_SET     { asm volatile ("bset _LATC, #11 \n"); }
#define BOOSTL1_CLEAR   { asm volatile ("bclr _LATC, #11 \n"); }
#define BOOSTL1_TOGGLE  { asm volatile ("btg  _LATC, #11 \n"); }
#define BOOSTL1_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define BOOSTL1_INIT_OUTPUT  {BOOSTL1_WR = PINSTATE_LOW; BOOSTL1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define BOOSTL1_INIT_INPUT   {BOOSTL1_WR = PINSTATE_HIGH; BOOSTL1_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define BOOSTL1_PGx_CHANNEL  7 // PWM channel index
#define BOOSTL1_PGx_PER      PG7PER // PWM channel period register
#define BOOSTL1_PGx_PHASE    PG7PHASE // PWM channel phase register
#define BOOSTL1_PGx_DC       PG7DC // PWM channel duty cycle register
#define BOOSTL1_PGx_DCA      PG7DCA// PWM channel duty cycle A register
#define BOOSTL1_PGx_DTH      PG7DTH // PWM channel rising edge dead time register
#define BOOSTL1_PGx_DTL      PG7DTL // PWM channel falling edge dead time register
#define BOOSTL1_PGx_OVRENL   PG7IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define BOOSTL1_PGx_PENL     PG7IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define BOOSTL1_PGxUPDREQ    PG7STATbits.UPDREQ // PWM channel ADC trigger A register
#define BOOSTL1_PGxTRIGA     PG7TRIGA // PWM channel ADC trigger A register
#define BOOSTL1_PGxTRIGB     PG7TRIGB // PWM channel ADC trigger A register
#define BOOSTL1_PGxTRIGC     PG7TRIGC // PWM channel ADC trigger A register

// Device Pin #3 is RC12
#define HUB_RST_TRIS    TRISCbits.TRISC12 // GPIO direction register bit
#define HUB_RST_WR      LATCbits.LATC12 // GPIO port latch register bit
#define HUB_RST_RD      PORTCbits.RC12 // GPIO port register bit
#define HUB_RST_ODC     ODCCbits.ODCC12 // GPIO port open drain configuration register bit
#define HUB_RST_CNPU    CNPUCbits.CNPUC12 // GPIO port pull-up resistor register bit
#define HUB_RST_CNPD    CNPDCbits.CNPDC12 // GPIO port pull-down resistor register bit
#define HUB_RST_CNEN0   CNEN0Cbits.CNEN0C12 // GPIO port change notification Enable register bit
#define HUB_RST_CNSTAT  CNSTATCbits.CNSTATC12 // GPIO port change notification Status register bit
#define HUB_RST_CNEN1   CNEN1Cbits.CNEN1C12 // GPIO port change notification Edge Select Enable register bit
#define HUB_RST_CNF     CNFCbits.CNFC12 // GPIO port change notification flag bit register bit
#define HUB_RST_RP      60 // Number of Remappable Pin
#define HUB_RST_SET     { asm volatile ("bset _LATC, #12 \n"); }
#define HUB_RST_CLEAR   { asm volatile ("bclr _LATC, #12 \n"); }
#define HUB_RST_TOGGLE  { asm volatile ("btg  _LATC, #12 \n"); }
#define HUB_RST_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define HUB_RST_INIT_OUTPUT  {HUB_RST_WR = PINSTATE_LOW; HUB_RST_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define HUB_RST_INIT_INPUT   {HUB_RST_WR = PINSTATE_HIGH; HUB_RST_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define HUB_RST_PGx_CHANNEL  8 // PWM channel index
#define HUB_RST_PGx_PER      PG8PER // PWM channel period register
#define HUB_RST_PGx_PHASE    PG8PHASE // PWM channel phase register
#define HUB_RST_PGx_DC       PG8DC // PWM channel duty cycle register
#define HUB_RST_PGx_DCA      PG8DCA// PWM channel duty cycle A register
#define HUB_RST_PGx_DTH      PG8DTH // PWM channel rising edge dead time register
#define HUB_RST_PGx_DTL      PG8DTL // PWM channel falling edge dead time register
#define HUB_RST_PGx_OVRENH   PG8IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define HUB_RST_PGx_PENH     PG8IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define HUB_RST_PGxUPDREQ    PG8STATbits.UPDREQ // PWM channel ADC trigger A register
#define HUB_RST_PGxTRIGA     PG8TRIGA // PWM channel ADC trigger A register
#define HUB_RST_PGxTRIGB     PG8TRIGB // PWM channel ADC trigger A register
#define HUB_RST_PGxTRIGC     PG8TRIGC // PWM channel ADC trigger A register
#define HUB_RST_PWM_IF       _PWM8IF // interrupt flag bit
#define HUB_RST_PWM_IE       _PWM8IE // interrupt enable bit
#define HUB_RST_PWM_IP       _PWM8IP // interrupt priority for this analog input
#define _HUB_RST_PWM_Interrupt _PWM8Interrupt // Interrupt Service Routine name declaration

// Device Pin #4 is RC13
#define HUB_PRTPWR2_TRIS    TRISCbits.TRISC13 // GPIO direction register bit
#define HUB_PRTPWR2_WR      LATCbits.LATC13 // GPIO port latch register bit
#define HUB_PRTPWR2_RD      PORTCbits.RC13 // GPIO port register bit
#define HUB_PRTPWR2_ODC     ODCCbits.ODCC13 // GPIO port open drain configuration register bit
#define HUB_PRTPWR2_CNPU    CNPUCbits.CNPUC13 // GPIO port pull-up resistor register bit
#define HUB_PRTPWR2_CNPD    CNPDCbits.CNPDC13 // GPIO port pull-down resistor register bit
#define HUB_PRTPWR2_CNEN0   CNEN0Cbits.CNEN0C13 // GPIO port change notification Enable register bit
#define HUB_PRTPWR2_CNSTAT  CNSTATCbits.CNSTATC13 // GPIO port change notification Status register bit
#define HUB_PRTPWR2_CNEN1   CNEN1Cbits.CNEN1C13 // GPIO port change notification Edge Select Enable register bit
#define HUB_PRTPWR2_CNF     CNFCbits.CNFC13 // GPIO port change notification flag bit register bit
#define HUB_PRTPWR2_RP      61 // Number of Remappable Pin
#define HUB_PRTPWR2_SET     { asm volatile ("bset _LATC, #13 \n"); }
#define HUB_PRTPWR2_CLEAR   { asm volatile ("bclr _LATC, #13 \n"); }
#define HUB_PRTPWR2_TOGGLE  { asm volatile ("btg  _LATC, #13 \n"); }
#define HUB_PRTPWR2_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define HUB_PRTPWR2_INIT_OUTPUT  {HUB_PRTPWR2_WR = PINSTATE_LOW; HUB_PRTPWR2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define HUB_PRTPWR2_INIT_INPUT   {HUB_PRTPWR2_WR = PINSTATE_HIGH; HUB_PRTPWR2_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define HUB_PRTPWR2_PGx_CHANNEL  8 // PWM channel index
#define HUB_PRTPWR2_PGx_PER      PG8PER // PWM channel period register
#define HUB_PRTPWR2_PGx_PHASE    PG8PHASE // PWM channel phase register
#define HUB_PRTPWR2_PGx_DC       PG8DC // PWM channel duty cycle register
#define HUB_PRTPWR2_PGx_DCA      PG8DCA// PWM channel duty cycle A register
#define HUB_PRTPWR2_PGx_DTH      PG8DTH // PWM channel rising edge dead time register
#define HUB_PRTPWR2_PGx_DTL      PG8DTL // PWM channel falling edge dead time register
#define HUB_PRTPWR2_PGx_OVRENL   PG8IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define HUB_PRTPWR2_PGx_PENL     PG8IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define HUB_PRTPWR2_PGxUPDREQ    PG8STATbits.UPDREQ // PWM channel ADC trigger A register
#define HUB_PRTPWR2_PGxTRIGA     PG8TRIGA // PWM channel ADC trigger A register
#define HUB_PRTPWR2_PGxTRIGB     PG8TRIGB // PWM channel ADC trigger A register
#define HUB_PRTPWR2_PGxTRIGC     PG8TRIGC // PWM channel ADC trigger A register

// Device Pin #5 is RC14
#define ECP31_TRIS    TRISCbits.TRISC14 // GPIO direction register bit
#define ECP31_WR      LATCbits.LATC14 // GPIO port latch register bit
#define ECP31_RD      PORTCbits.RC14 // GPIO port register bit
#define ECP31_ODC     ODCCbits.ODCC14 // GPIO port open drain configuration register bit
#define ECP31_CNPU    CNPUCbits.CNPUC14 // GPIO port pull-up resistor register bit
#define ECP31_CNPD    CNPDCbits.CNPDC14 // GPIO port pull-down resistor register bit
#define ECP31_CNEN0   CNEN0Cbits.CNEN0C14 // GPIO port change notification Enable register bit
#define ECP31_CNSTAT  CNSTATCbits.CNSTATC14 // GPIO port change notification Status register bit
#define ECP31_CNEN1   CNEN1Cbits.CNEN1C14 // GPIO port change notification Edge Select Enable register bit
#define ECP31_CNF     CNFCbits.CNFC14 // GPIO port change notification flag bit register bit
#define ECP31_RP      62 // Number of Remappable Pin
#define ECP31_SET     { asm volatile ("bset _LATC, #14 \n"); }
#define ECP31_CLEAR   { asm volatile ("bclr _LATC, #14 \n"); }
#define ECP31_TOGGLE  { asm volatile ("btg  _LATC, #14 \n"); }
#define ECP31_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP31_INIT_OUTPUT  {ECP31_WR = PINSTATE_LOW; ECP31_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP31_INIT_INPUT   {ECP31_WR = PINSTATE_HIGH; ECP31_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP31_PGx_CHANNEL  6 // PWM channel index
#define ECP31_PGx_PER      PG6PER // PWM channel period register
#define ECP31_PGx_PHASE    PG6PHASE // PWM channel phase register
#define ECP31_PGx_DC       PG6DC // PWM channel duty cycle register
#define ECP31_PGx_DCA      PG6DCA// PWM channel duty cycle A register
#define ECP31_PGx_DTH      PG6DTH // PWM channel rising edge dead time register
#define ECP31_PGx_DTL      PG6DTL // PWM channel falling edge dead time register
#define ECP31_PGx_OVRENH   PG6IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define ECP31_PGx_PENH     PG6IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define ECP31_PGxUPDREQ    PG6STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP31_PGxTRIGA     PG6TRIGA // PWM channel ADC trigger A register
#define ECP31_PGxTRIGB     PG6TRIGB // PWM channel ADC trigger A register
#define ECP31_PGxTRIGC     PG6TRIGC // PWM channel ADC trigger A register
#define ECP31_PWM_IF       _PWM6IF // interrupt flag bit
#define ECP31_PWM_IE       _PWM6IE // interrupt enable bit
#define ECP31_PWM_IP       _PWM6IP // interrupt priority for this analog input
#define _ECP31_PWM_Interrupt _PWM6Interrupt // Interrupt Service Routine name declaration

// Device Pin #6 is RC15
#define ECP33_TRIS    TRISCbits.TRISC15 // GPIO direction register bit
#define ECP33_WR      LATCbits.LATC15 // GPIO port latch register bit
#define ECP33_RD      PORTCbits.RC15 // GPIO port register bit
#define ECP33_ODC     ODCCbits.ODCC15 // GPIO port open drain configuration register bit
#define ECP33_CNPU    CNPUCbits.CNPUC15 // GPIO port pull-up resistor register bit
#define ECP33_CNPD    CNPDCbits.CNPDC15 // GPIO port pull-down resistor register bit
#define ECP33_CNEN0   CNEN0Cbits.CNEN0C15 // GPIO port change notification Enable register bit
#define ECP33_CNSTAT  CNSTATCbits.CNSTATC15 // GPIO port change notification Status register bit
#define ECP33_CNEN1   CNEN1Cbits.CNEN1C15 // GPIO port change notification Edge Select Enable register bit
#define ECP33_CNF     CNFCbits.CNFC15 // GPIO port change notification flag bit register bit
#define ECP33_RP      63 // Number of Remappable Pin
#define ECP33_SET     { asm volatile ("bset _LATC, #15 \n"); }
#define ECP33_CLEAR   { asm volatile ("bclr _LATC, #15 \n"); }
#define ECP33_TOGGLE  { asm volatile ("btg  _LATC, #15 \n"); }
#define ECP33_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP33_INIT_OUTPUT  {ECP33_WR = PINSTATE_LOW; ECP33_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP33_INIT_INPUT   {ECP33_WR = PINSTATE_HIGH; ECP33_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP33_PGx_CHANNEL  6 // PWM channel index
#define ECP33_PGx_PER      PG6PER // PWM channel period register
#define ECP33_PGx_PHASE    PG6PHASE // PWM channel phase register
#define ECP33_PGx_DC       PG6DC // PWM channel duty cycle register
#define ECP33_PGx_DCA      PG6DCA// PWM channel duty cycle A register
#define ECP33_PGx_DTH      PG6DTH // PWM channel rising edge dead time register
#define ECP33_PGx_DTL      PG6DTL // PWM channel falling edge dead time register
#define ECP33_PGx_OVRENL   PG6IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define ECP33_PGx_PENL     PG6IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define ECP33_PGxUPDREQ    PG6STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP33_PGxTRIGA     PG6TRIGA // PWM channel ADC trigger A register
#define ECP33_PGxTRIGB     PG6TRIGB // PWM channel ADC trigger A register
#define ECP33_PGxTRIGC     PG6TRIGC // PWM channel ADC trigger A register

// Device Pin #23 is RC2
#define ECP17_TRIS    TRISCbits.TRISC2 // GPIO direction register bit
#define ECP17_WR      LATCbits.LATC2 // GPIO port latch register bit
#define ECP17_RD      PORTCbits.RC2 // GPIO port register bit
#define ECP17_ODC     ODCCbits.ODCC2 // GPIO port open drain configuration register bit
#define ECP17_CNPU    CNPUCbits.CNPUC2 // GPIO port pull-up resistor register bit
#define ECP17_CNPD    CNPDCbits.CNPDC2 // GPIO port pull-down resistor register bit
#define ECP17_CNEN0   CNEN0Cbits.CNEN0C2 // GPIO port change notification Enable register bit
#define ECP17_CNSTAT  CNSTATCbits.CNSTATC2 // GPIO port change notification Status register bit
#define ECP17_CNEN1   CNEN1Cbits.CNEN1C2 // GPIO port change notification Edge Select Enable register bit
#define ECP17_CNF     CNFCbits.CNFC2 // GPIO port change notification flag bit register bit
#define ECP17_RP      50 // Number of Remappable Pin
#define ECP17_SET     { asm volatile ("bset _LATC, #2 \n"); }
#define ECP17_CLEAR   { asm volatile ("bclr _LATC, #2 \n"); }
#define ECP17_TOGGLE  { asm volatile ("btg  _LATC, #2 \n"); }
#define ECP17_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define ECP17_ANSEL   _ANSELC2 // analog/digital pin configuration register bit
#define ECP17_ADCCORE  // index starts from zero, last index indicated shared adC core
#define ECP17_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP17_ADC_AN_INPUT 14   // ANx input pin number
#define ECP17_ADCBUF  ADCBUF14 // ADC buffer register for this input
#define ECP17_ADC_ANIE ADIELbits.IE14
#define ECP17_ADC_ANEIE ADEIELbits.EIEN14
#define ECP17_ADC_IF   _ADCAN14IF // interrupt flag bit
#define ECP17_ADC_IE   _ADCAN14IE // interrupt enable bit
#define ECP17_ADC_IP   _ADCAN14IP // interrupt priority for this analog input
#define ECP17_ADC_RDY  _AN14RDY // ADC buffer ready bit
#define _ECP17_ADC_Interrupt _ADCAN14Interrupt
#define ECP17_INIT_ANALOG	{ECP17_ANSEL = 1; ECP17_WR = PINSTATE_HIGH; ECP17_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP17_INIT_OUTPUT  {ECP17_WR = PINSTATE_LOW; ECP17_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP17_INIT_INPUT   {ECP17_WR = PINSTATE_HIGH; ECP17_TRIS = PINDIR_INPUT;} // initialization macro for digital input

