areiter128/USB-PD-BoB/h/mcal/config/MA330048_P33CK_R30_USB_PD_BOB_pinmap.h
// Device Pin #27 is RC3
#define LED_AUX_CTRL_TRIS    TRISCbits.TRISC3 // GPIO direction register bit
#define LED_AUX_CTRL_WR      LATCbits.LATC3 // GPIO port latch register bit
#define LED_AUX_CTRL_RD      PORTCbits.RC3 // GPIO port register bit
#define LED_AUX_CTRL_ODC     ODCCbits.ODCC3 // GPIO port open drain configuration register bit
#define LED_AUX_CTRL_CNPU    CNPUCbits.CNPUC3 // GPIO port pull-up resistor register bit
#define LED_AUX_CTRL_CNPD    CNPDCbits.CNPDC3 // GPIO port pull-down resistor register bit
#define LED_AUX_CTRL_CNEN0   CNEN0Cbits.CNEN0C3 // GPIO port change notification Enable register bit
#define LED_AUX_CTRL_CNSTAT  CNSTATCbits.CNSTATC3 // GPIO port change notification Status register bit
#define LED_AUX_CTRL_CNEN1   CNEN1Cbits.CNEN1C3 // GPIO port change notification Edge Select Enable register bit
#define LED_AUX_CTRL_CNF     CNFCbits.CNFC3 // GPIO port change notification flag bit register bit
#define LED_AUX_CTRL_RP      51 // Number of Remappable Pin
#define LED_AUX_CTRL_SET     { asm volatile ("bset _LATC, #3 \n"); }
#define LED_AUX_CTRL_CLEAR   { asm volatile ("bclr _LATC, #3 \n"); }
#define LED_AUX_CTRL_TOGGLE  { asm volatile ("btg  _LATC, #3 \n"); }
#define LED_AUX_CTRL_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define LED_AUX_CTRL_ANSEL   _ANSELC3 // analog/digital pin configuration register bit
#define LED_AUX_CTRL_ADCCORE  // index starts from zero, last index indicated shared adC core
#define LED_AUX_CTRL_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define LED_AUX_CTRL_ADC_AN_INPUT 15   // ANx input pin number
#define LED_AUX_CTRL_ADCBUF  ADCBUF15 // ADC buffer register for this input
#define LED_AUX_CTRL_ADC_ANIE ADIELbits.IE15
#define LED_AUX_CTRL_ADC_ANEIE ADEIELbits.EIEN15
#define LED_AUX_CTRL_ADC_IF   _ADCAN15IF // interrupt flag bit
#define LED_AUX_CTRL_ADC_IE   _ADCAN15IE // interrupt enable bit
#define LED_AUX_CTRL_ADC_IP   _ADCAN15IP // interrupt priority for this analog input
#define LED_AUX_CTRL_ADC_RDY  _AN15RDY // ADC buffer ready bit
#define _LED_AUX_CTRL_ADC_Interrupt _ADCAN15Interrupt
#define LED_AUX_CTRL_INIT_ANALOG	{LED_AUX_CTRL_ANSEL = 1; LED_AUX_CTRL_WR = PINSTATE_HIGH; LED_AUX_CTRL_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define LED_AUX_CTRL_INIT_OUTPUT  {LED_AUX_CTRL_WR = PINSTATE_LOW; LED_AUX_CTRL_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define LED_AUX_CTRL_INIT_INPUT   {LED_AUX_CTRL_WR = PINSTATE_HIGH; LED_AUX_CTRL_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #50 is RC4
#define BUCKH1_TRIS    TRISCbits.TRISC4 // GPIO direction register bit
#define BUCKH1_WR      LATCbits.LATC4 // GPIO port latch register bit
#define BUCKH1_RD      PORTCbits.RC4 // GPIO port register bit
#define BUCKH1_ODC     ODCCbits.ODCC4 // GPIO port open drain configuration register bit
#define BUCKH1_CNPU    CNPUCbits.CNPUC4 // GPIO port pull-up resistor register bit
#define BUCKH1_CNPD    CNPDCbits.CNPDC4 // GPIO port pull-down resistor register bit
#define BUCKH1_CNEN0   CNEN0Cbits.CNEN0C4 // GPIO port change notification Enable register bit
#define BUCKH1_CNSTAT  CNSTATCbits.CNSTATC4 // GPIO port change notification Status register bit
#define BUCKH1_CNEN1   CNEN1Cbits.CNEN1C4 // GPIO port change notification Edge Select Enable register bit
#define BUCKH1_CNF     CNFCbits.CNFC4 // GPIO port change notification flag bit register bit
#define BUCKH1_RP      52 // Number of Remappable Pin
#define BUCKH1_SET     { asm volatile ("bset _LATC, #4 \n"); }
#define BUCKH1_CLEAR   { asm volatile ("bclr _LATC, #4 \n"); }
#define BUCKH1_TOGGLE  { asm volatile ("btg  _LATC, #4 \n"); }
#define BUCKH1_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define BUCKH1_INIT_OUTPUT  {BUCKH1_WR = PINSTATE_LOW; BUCKH1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define BUCKH1_INIT_INPUT   {BUCKH1_WR = PINSTATE_HIGH; BUCKH1_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define BUCKH1_PGx_CHANNEL  5 // PWM channel index
#define BUCKH1_PGx_PER      PG5PER // PWM channel period register
#define BUCKH1_PGx_PHASE    PG5PHASE // PWM channel phase register
#define BUCKH1_PGx_DC       PG5DC // PWM channel duty cycle register
#define BUCKH1_PGx_DCA      PG5DCA// PWM channel duty cycle A register
#define BUCKH1_PGx_DTH      PG5DTH // PWM channel rising edge dead time register
#define BUCKH1_PGx_DTL      PG5DTL // PWM channel falling edge dead time register
#define BUCKH1_PGx_OVRENH   PG5IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define BUCKH1_PGx_PENH     PG5IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define BUCKH1_PGxUPDREQ    PG5STATbits.UPDREQ // PWM channel ADC trigger A register
#define BUCKH1_PGxTRIGA     PG5TRIGA // PWM channel ADC trigger A register
#define BUCKH1_PGxTRIGB     PG5TRIGB // PWM channel ADC trigger A register
#define BUCKH1_PGxTRIGC     PG5TRIGC // PWM channel ADC trigger A register
#define BUCKH1_PWM_IF       _PWM5IF // interrupt flag bit
#define BUCKH1_PWM_IE       _PWM5IE // interrupt enable bit
#define BUCKH1_PWM_IP       _PWM5IP // interrupt priority for this analog input
#define _BUCKH1_PWM_Interrupt _PWM5Interrupt // Interrupt Service Routine name declaration

// Device Pin #51 is RC5
#define BUCKL1_TRIS    TRISCbits.TRISC5 // GPIO direction register bit
#define BUCKL1_WR      LATCbits.LATC5 // GPIO port latch register bit
#define BUCKL1_RD      PORTCbits.RC5 // GPIO port register bit
#define BUCKL1_ODC     ODCCbits.ODCC5 // GPIO port open drain configuration register bit
#define BUCKL1_CNPU    CNPUCbits.CNPUC5 // GPIO port pull-up resistor register bit
#define BUCKL1_CNPD    CNPDCbits.CNPDC5 // GPIO port pull-down resistor register bit
#define BUCKL1_CNEN0   CNEN0Cbits.CNEN0C5 // GPIO port change notification Enable register bit
#define BUCKL1_CNSTAT  CNSTATCbits.CNSTATC5 // GPIO port change notification Status register bit
#define BUCKL1_CNEN1   CNEN1Cbits.CNEN1C5 // GPIO port change notification Edge Select Enable register bit
#define BUCKL1_CNF     CNFCbits.CNFC5 // GPIO port change notification flag bit register bit
#define BUCKL1_RP      53 // Number of Remappable Pin
#define BUCKL1_SET     { asm volatile ("bset _LATC, #5 \n"); }
#define BUCKL1_CLEAR   { asm volatile ("bclr _LATC, #5 \n"); }
#define BUCKL1_TOGGLE  { asm volatile ("btg  _LATC, #5 \n"); }
#define BUCKL1_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define BUCKL1_INIT_OUTPUT  {BUCKL1_WR = PINSTATE_LOW; BUCKL1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define BUCKL1_INIT_INPUT   {BUCKL1_WR = PINSTATE_HIGH; BUCKL1_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define BUCKL1_PGx_CHANNEL  5 // PWM channel index
#define BUCKL1_PGx_PER      PG5PER // PWM channel period register
#define BUCKL1_PGx_PHASE    PG5PHASE // PWM channel phase register
#define BUCKL1_PGx_DC       PG5DC // PWM channel duty cycle register
#define BUCKL1_PGx_DCA      PG5DCA// PWM channel duty cycle A register
#define BUCKL1_PGx_DTH      PG5DTH // PWM channel rising edge dead time register
#define BUCKL1_PGx_DTL      PG5DTL // PWM channel falling edge dead time register
#define BUCKL1_PGx_OVRENL   PG5IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define BUCKL1_PGx_PENL     PG5IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define BUCKL1_PGxUPDREQ    PG5STATbits.UPDREQ // PWM channel ADC trigger A register
#define BUCKL1_PGxTRIGA     PG5TRIGA // PWM channel ADC trigger A register
#define BUCKL1_PGxTRIGB     PG5TRIGB // PWM channel ADC trigger A register
#define BUCKL1_PGxTRIGC     PG5TRIGC // PWM channel ADC trigger A register

// Device Pin #24 is RC6
#define FB_TEMP2_TRIS    TRISCbits.TRISC6 // GPIO direction register bit
#define FB_TEMP2_WR      LATCbits.LATC6 // GPIO port latch register bit
#define FB_TEMP2_RD      PORTCbits.RC6 // GPIO port register bit
#define FB_TEMP2_ODC     ODCCbits.ODCC6 // GPIO port open drain configuration register bit
#define FB_TEMP2_CNPU    CNPUCbits.CNPUC6 // GPIO port pull-up resistor register bit
#define FB_TEMP2_CNPD    CNPDCbits.CNPDC6 // GPIO port pull-down resistor register bit
#define FB_TEMP2_CNEN0   CNEN0Cbits.CNEN0C6 // GPIO port change notification Enable register bit
#define FB_TEMP2_CNSTAT  CNSTATCbits.CNSTATC6 // GPIO port change notification Status register bit
#define FB_TEMP2_CNEN1   CNEN1Cbits.CNEN1C6 // GPIO port change notification Edge Select Enable register bit
#define FB_TEMP2_CNF     CNFCbits.CNFC6 // GPIO port change notification flag bit register bit
#define FB_TEMP2_RP      54 // Number of Remappable Pin
#define FB_TEMP2_SET     { asm volatile ("bset _LATC, #6 \n"); }
#define FB_TEMP2_CLEAR   { asm volatile ("bclr _LATC, #6 \n"); }
#define FB_TEMP2_TOGGLE  { asm volatile ("btg  _LATC, #6 \n"); }
#define FB_TEMP2_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define FB_TEMP2_ANSEL   _ANSELC6 // analog/digital pin configuration register bit
#define FB_TEMP2_ADCCORE  // index starts from zero, last index indicated shared adC core
#define FB_TEMP2_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define FB_TEMP2_ADC_AN_INPUT N1   // ANx input pin number
#define FB_TEMP2_ADCBUF  ADCBUFN1 // ADC buffer register for this input
#define FB_TEMP2_ADC_ANIE ADIEHbits.IEN1
#define FB_TEMP2_ADC_ANEIE ADEIEHbits.EIENN1
#define FB_TEMP2_ADC_IF   _ADCANN1IF // interrupt flag bit
#define FB_TEMP2_ADC_IE   _ADCANN1IE // interrupt enable bit
#define FB_TEMP2_ADC_IP   _ADCANN1IP // interrupt priority for this analog input
#define FB_TEMP2_ADC_RDY  _ANN1RDY // ADC buffer ready bit
#define _FB_TEMP2_ADC_Interrupt _ADCANN1Interrupt
#define FB_TEMP2_INIT_ANALOG	{FB_TEMP2_ANSEL = 1; FB_TEMP2_WR = PINSTATE_HIGH; FB_TEMP2_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define FB_TEMP2_INIT_OUTPUT  {FB_TEMP2_WR = PINSTATE_LOW; FB_TEMP2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define FB_TEMP2_INIT_INPUT   {FB_TEMP2_WR = PINSTATE_HIGH; FB_TEMP2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #32 is RC7
#define FB_VOUT1_TRIS    TRISCbits.TRISC7 // GPIO direction register bit
#define FB_VOUT1_WR      LATCbits.LATC7 // GPIO port latch register bit
#define FB_VOUT1_RD      PORTCbits.RC7 // GPIO port register bit
#define FB_VOUT1_ODC     ODCCbits.ODCC7 // GPIO port open drain configuration register bit
#define FB_VOUT1_CNPU    CNPUCbits.CNPUC7 // GPIO port pull-up resistor register bit
#define FB_VOUT1_CNPD    CNPDCbits.CNPDC7 // GPIO port pull-down resistor register bit
#define FB_VOUT1_CNEN0   CNEN0Cbits.CNEN0C7 // GPIO port change notification Enable register bit
#define FB_VOUT1_CNSTAT  CNSTATCbits.CNSTATC7 // GPIO port change notification Status register bit
#define FB_VOUT1_CNEN1   CNEN1Cbits.CNEN1C7 // GPIO port change notification Edge Select Enable register bit
#define FB_VOUT1_CNF     CNFCbits.CNFC7 // GPIO port change notification flag bit register bit
#define FB_VOUT1_RP      55 // Number of Remappable Pin
#define FB_VOUT1_SET     { asm volatile ("bset _LATC, #7 \n"); }
#define FB_VOUT1_CLEAR   { asm volatile ("bclr _LATC, #7 \n"); }
#define FB_VOUT1_TOGGLE  { asm volatile ("btg  _LATC, #7 \n"); }
#define FB_VOUT1_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define FB_VOUT1_ANSEL   _ANSELC7 // analog/digital pin configuration register bit
#define FB_VOUT1_ADCCORE  // index starts from zero, last index indicated shared adC core
#define FB_VOUT1_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define FB_VOUT1_ADC_AN_INPUT 16   // ANx input pin number
#define FB_VOUT1_ADCBUF  ADCBUF16 // ADC buffer register for this input
#define FB_VOUT1_ADC_ANIE ADIEHbits.IE16
#define FB_VOUT1_ADC_ANEIE ADEIEHbits.EIEN16
#define FB_VOUT1_ADC_IF   _ADCAN16IF // interrupt flag bit
#define FB_VOUT1_ADC_IE   _ADCAN16IE // interrupt enable bit
#define FB_VOUT1_ADC_IP   _ADCAN16IP // interrupt priority for this analog input
#define FB_VOUT1_ADC_RDY  _AN16RDY // ADC buffer ready bit
#define _FB_VOUT1_ADC_Interrupt _ADCAN16Interrupt
#define FB_VOUT1_INIT_ANALOG	{FB_VOUT1_ANSEL = 1; FB_VOUT1_WR = PINSTATE_HIGH; FB_VOUT1_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define FB_VOUT1_INIT_OUTPUT  {FB_VOUT1_WR = PINSTATE_LOW; FB_VOUT1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define FB_VOUT1_INIT_INPUT   {FB_VOUT1_WR = PINSTATE_HIGH; FB_VOUT1_TRIS = PINDIR_INPUT;} // initialization macro for digital input

