areiter128/USB-PD-BoB/h/mcal/config/MA330048_P33CK_R30_USB_PD_BOB_pinmap.h
// Device Pin #36 is RC8
#define SPI_CLK_TRIS    TRISCbits.TRISC8 // GPIO direction register bit
#define SPI_CLK_WR      LATCbits.LATC8 // GPIO port latch register bit
#define SPI_CLK_RD      PORTCbits.RC8 // GPIO port register bit
#define SPI_CLK_ODC     ODCCbits.ODCC8 // GPIO port open drain configuration register bit
#define SPI_CLK_CNPU    CNPUCbits.CNPUC8 // GPIO port pull-up resistor register bit
#define SPI_CLK_CNPD    CNPDCbits.CNPDC8 // GPIO port pull-down resistor register bit
#define SPI_CLK_CNEN0   CNEN0Cbits.CNEN0C8 // GPIO port change notification Enable register bit
#define SPI_CLK_CNSTAT  CNSTATCbits.CNSTATC8 // GPIO port change notification Status register bit
#define SPI_CLK_CNEN1   CNEN1Cbits.CNEN1C8 // GPIO port change notification Edge Select Enable register bit
#define SPI_CLK_CNF     CNFCbits.CNFC8 // GPIO port change notification flag bit register bit
#define SPI_CLK_RP      56 // Number of Remappable Pin
#define SPI_CLK_SET     { asm volatile ("bset _LATC, #8 \n"); }
#define SPI_CLK_CLEAR   { asm volatile ("bclr _LATC, #8 \n"); }
#define SPI_CLK_TOGGLE  { asm volatile ("btg  _LATC, #8 \n"); }
#define SPI_CLK_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define SPI_CLK_INIT_OUTPUT  {SPI_CLK_WR = PINSTATE_LOW; SPI_CLK_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SPI_CLK_INIT_INPUT   {SPI_CLK_WR = PINSTATE_HIGH; SPI_CLK_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #37 is RC9
#define SPI_MISO_TRIS    TRISCbits.TRISC9 // GPIO direction register bit
#define SPI_MISO_WR      LATCbits.LATC9 // GPIO port latch register bit
#define SPI_MISO_RD      PORTCbits.RC9 // GPIO port register bit
#define SPI_MISO_ODC     ODCCbits.ODCC9 // GPIO port open drain configuration register bit
#define SPI_MISO_CNPU    CNPUCbits.CNPUC9 // GPIO port pull-up resistor register bit
#define SPI_MISO_CNPD    CNPDCbits.CNPDC9 // GPIO port pull-down resistor register bit
#define SPI_MISO_CNEN0   CNEN0Cbits.CNEN0C9 // GPIO port change notification Enable register bit
#define SPI_MISO_CNSTAT  CNSTATCbits.CNSTATC9 // GPIO port change notification Status register bit
#define SPI_MISO_CNEN1   CNEN1Cbits.CNEN1C9 // GPIO port change notification Edge Select Enable register bit
#define SPI_MISO_CNF     CNFCbits.CNFC9 // GPIO port change notification flag bit register bit
#define SPI_MISO_RP      57 // Number of Remappable Pin
#define SPI_MISO_SET     { asm volatile ("bset _LATC, #9 \n"); }
#define SPI_MISO_CLEAR   { asm volatile ("bclr _LATC, #9 \n"); }
#define SPI_MISO_TOGGLE  { asm volatile ("btg  _LATC, #9 \n"); }
#define SPI_MISO_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define SPI_MISO_INIT_OUTPUT  {SPI_MISO_WR = PINSTATE_LOW; SPI_MISO_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SPI_MISO_INIT_INPUT   {SPI_MISO_WR = PINSTATE_HIGH; SPI_MISO_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #60 is RD0
#define ECP44_TRIS    TRISDbits.TRISD0 // GPIO direction register bit
#define ECP44_WR      LATDbits.LATD0 // GPIO port latch register bit
#define ECP44_RD      PORTDbits.RD0 // GPIO port register bit
#define ECP44_ODC     ODCDbits.ODCD0 // GPIO port open drain configuration register bit
#define ECP44_CNPU    CNPUDbits.CNPUD0 // GPIO port pull-up resistor register bit
#define ECP44_CNPD    CNPDDbits.CNPDD0 // GPIO port pull-down resistor register bit
#define ECP44_CNEN0   CNEN0Dbits.CNEN0D0 // GPIO port change notification Enable register bit
#define ECP44_CNSTAT  CNSTATDbits.CNSTATD0 // GPIO port change notification Status register bit
#define ECP44_CNEN1   CNEN1Dbits.CNEN1D0 // GPIO port change notification Edge Select Enable register bit
#define ECP44_CNF     CNFDbits.CNFD0 // GPIO port change notification flag bit register bit
#define ECP44_RP      64 // Number of Remappable Pin
#define ECP44_SET     { asm volatile ("bset _LATD, #0 \n"); }
#define ECP44_CLEAR   { asm volatile ("bclr _LATD, #0 \n"); }
#define ECP44_TOGGLE  { asm volatile ("btg  _LATD, #0 \n"); }
#define ECP44_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP44_INIT_OUTPUT  {ECP44_WR = PINSTATE_LOW; ECP44_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP44_INIT_INPUT   {ECP44_WR = PINSTATE_HIGH; ECP44_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP44_PGx_CHANNEL  4 // PWM channel index
#define ECP44_PGx_PER      PG4PER // PWM channel period register
#define ECP44_PGx_PHASE    PG4PHASE // PWM channel phase register
#define ECP44_PGx_DC       PG4DC // PWM channel duty cycle register
#define ECP44_PGx_DCA      PG4DCA// PWM channel duty cycle A register
#define ECP44_PGx_DTH      PG4DTH // PWM channel rising edge dead time register
#define ECP44_PGx_DTL      PG4DTL // PWM channel falling edge dead time register
#define ECP44_PGx_OVRENL   PG4IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define ECP44_PGx_PENL     PG4IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define ECP44_PGxUPDREQ    PG4STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP44_PGxTRIGA     PG4TRIGA // PWM channel ADC trigger A register
#define ECP44_PGxTRIGB     PG4TRIGB // PWM channel ADC trigger A register
#define ECP44_PGxTRIGC     PG4TRIGC // PWM channel ADC trigger A register

// Device Pin #59 is RD1
#define PPC_IRQ1_TRIS    TRISDbits.TRISD1 // GPIO direction register bit
#define PPC_IRQ1_WR      LATDbits.LATD1 // GPIO port latch register bit
#define PPC_IRQ1_RD      PORTDbits.RD1 // GPIO port register bit
#define PPC_IRQ1_ODC     ODCDbits.ODCD1 // GPIO port open drain configuration register bit
#define PPC_IRQ1_CNPU    CNPUDbits.CNPUD1 // GPIO port pull-up resistor register bit
#define PPC_IRQ1_CNPD    CNPDDbits.CNPDD1 // GPIO port pull-down resistor register bit
#define PPC_IRQ1_CNEN0   CNEN0Dbits.CNEN0D1 // GPIO port change notification Enable register bit
#define PPC_IRQ1_CNSTAT  CNSTATDbits.CNSTATD1 // GPIO port change notification Status register bit
#define PPC_IRQ1_CNEN1   CNEN1Dbits.CNEN1D1 // GPIO port change notification Edge Select Enable register bit
#define PPC_IRQ1_CNF     CNFDbits.CNFD1 // GPIO port change notification flag bit register bit
#define PPC_IRQ1_RP      65 // Number of Remappable Pin
#define PPC_IRQ1_SET     { asm volatile ("bset _LATD, #1 \n"); }
#define PPC_IRQ1_CLEAR   { asm volatile ("bclr _LATD, #1 \n"); }
#define PPC_IRQ1_TOGGLE  { asm volatile ("btg  _LATD, #1 \n"); }
#define PPC_IRQ1_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define PPC_IRQ1_INIT_OUTPUT  {PPC_IRQ1_WR = PINSTATE_LOW; PPC_IRQ1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define PPC_IRQ1_INIT_INPUT   {PPC_IRQ1_WR = PINSTATE_HIGH; PPC_IRQ1_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define PPC_IRQ1_PGx_CHANNEL  4 // PWM channel index
#define PPC_IRQ1_PGx_PER      PG4PER // PWM channel period register
#define PPC_IRQ1_PGx_PHASE    PG4PHASE // PWM channel phase register
#define PPC_IRQ1_PGx_DC       PG4DC // PWM channel duty cycle register
#define PPC_IRQ1_PGx_DCA      PG4DCA// PWM channel duty cycle A register
#define PPC_IRQ1_PGx_DTH      PG4DTH // PWM channel rising edge dead time register
#define PPC_IRQ1_PGx_DTL      PG4DTL // PWM channel falling edge dead time register
#define PPC_IRQ1_PGx_OVRENH   PG4IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define PPC_IRQ1_PGx_PENH     PG4IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define PPC_IRQ1_PGxUPDREQ    PG4STATbits.UPDREQ // PWM channel ADC trigger A register
#define PPC_IRQ1_PGxTRIGA     PG4TRIGA // PWM channel ADC trigger A register
#define PPC_IRQ1_PGxTRIGB     PG4TRIGB // PWM channel ADC trigger A register
#define PPC_IRQ1_PGxTRIGC     PG4TRIGC // PWM channel ADC trigger A register
#define PPC_IRQ1_PWM_IF       _PWM4IF // interrupt flag bit
#define PPC_IRQ1_PWM_IE       _PWM4IE // interrupt enable bit
#define PPC_IRQ1_PWM_IP       _PWM4IP // interrupt priority for this analog input
#define _PPC_IRQ1_PWM_Interrupt _PWM4Interrupt // Interrupt Service Routine name declaration

