areiter128/USB-PD-BoB/h/mcal/config/MA330048_P33CK_R30_USB_PD_BOB_pinmap.h
// Device Pin #31 is RD10
#define FB_IOUT1_TRIS    TRISDbits.TRISD10 // GPIO direction register bit
#define FB_IOUT1_WR      LATDbits.LATD10 // GPIO port latch register bit
#define FB_IOUT1_RD      PORTDbits.RD10 // GPIO port register bit
#define FB_IOUT1_ODC     ODCDbits.ODCD10 // GPIO port open drain configuration register bit
#define FB_IOUT1_CNPU    CNPUDbits.CNPUD10 // GPIO port pull-up resistor register bit
#define FB_IOUT1_CNPD    CNPDDbits.CNPDD10 // GPIO port pull-down resistor register bit
#define FB_IOUT1_CNEN0   CNEN0Dbits.CNEN0D10 // GPIO port change notification Enable register bit
#define FB_IOUT1_CNSTAT  CNSTATDbits.CNSTATD10 // GPIO port change notification Status register bit
#define FB_IOUT1_CNEN1   CNEN1Dbits.CNEN1D10 // GPIO port change notification Edge Select Enable register bit
#define FB_IOUT1_CNF     CNFDbits.CNFD10 // GPIO port change notification flag bit register bit
#define FB_IOUT1_RP      74 // Number of Remappable Pin
#define FB_IOUT1_SET     { asm volatile ("bset _LATD, #10 \n"); }
#define FB_IOUT1_CLEAR   { asm volatile ("bclr _LATD, #10 \n"); }
#define FB_IOUT1_TOGGLE  { asm volatile ("btg  _LATD, #10 \n"); }
#define FB_IOUT1_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define FB_IOUT1_ANSEL   _ANSELD10 // analog/digital pin configuration register bit
#define FB_IOUT1_ADCCORE  // index starts from zero, last index indicated shared adC core
#define FB_IOUT1_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define FB_IOUT1_ADC_AN_INPUT 18   // ANx input pin number
#define FB_IOUT1_ADCBUF  ADCBUF18 // ADC buffer register for this input
#define FB_IOUT1_ADC_ANIE ADIEHbits.IE18
#define FB_IOUT1_ADC_ANEIE ADEIEHbits.EIEN18
#define FB_IOUT1_ADC_IF   _ADCAN18IF // interrupt flag bit
#define FB_IOUT1_ADC_IE   _ADCAN18IE // interrupt enable bit
#define FB_IOUT1_ADC_IP   _ADCAN18IP // interrupt priority for this analog input
#define FB_IOUT1_ADC_RDY  _AN18RDY // ADC buffer ready bit
#define _FB_IOUT1_ADC_Interrupt _ADCAN18Interrupt
#define FB_IOUT1_INIT_ANALOG	{FB_IOUT1_ANSEL = 1; FB_IOUT1_WR = PINSTATE_HIGH; FB_IOUT1_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define FB_IOUT1_INIT_OUTPUT  {FB_IOUT1_WR = PINSTATE_LOW; FB_IOUT1_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define FB_IOUT1_INIT_INPUT   {FB_IOUT1_WR = PINSTATE_HIGH; FB_IOUT1_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #30 is RD11
#define ECP13_TRIS    TRISDbits.TRISD11 // GPIO direction register bit
#define ECP13_WR      LATDbits.LATD11 // GPIO port latch register bit
#define ECP13_RD      PORTDbits.RD11 // GPIO port register bit
#define ECP13_ODC     ODCDbits.ODCD11 // GPIO port open drain configuration register bit
#define ECP13_CNPU    CNPUDbits.CNPUD11 // GPIO port pull-up resistor register bit
#define ECP13_CNPD    CNPDDbits.CNPDD11 // GPIO port pull-down resistor register bit
#define ECP13_CNEN0   CNEN0Dbits.CNEN0D11 // GPIO port change notification Enable register bit
#define ECP13_CNSTAT  CNSTATDbits.CNSTATD11 // GPIO port change notification Status register bit
#define ECP13_CNEN1   CNEN1Dbits.CNEN1D11 // GPIO port change notification Edge Select Enable register bit
#define ECP13_CNF     CNFDbits.CNFD11 // GPIO port change notification flag bit register bit
#define ECP13_RP      75 // Number of Remappable Pin
#define ECP13_SET     { asm volatile ("bset _LATD, #11 \n"); }
#define ECP13_CLEAR   { asm volatile ("bclr _LATD, #11 \n"); }
#define ECP13_TOGGLE  { asm volatile ("btg  _LATD, #11 \n"); }
#define ECP13_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define ECP13_ANSEL   _ANSELD11 // analog/digital pin configuration register bit
#define ECP13_ADCCORE  // index starts from zero, last index indicated shared adC core
#define ECP13_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP13_ADC_AN_INPUT 19   // ANx input pin number
#define ECP13_ADCBUF  ADCBUF19 // ADC buffer register for this input
#define ECP13_ADC_ANIE ADIEHbits.IE19
#define ECP13_ADC_ANEIE ADEIEHbits.EIEN19
#define ECP13_ADC_IF   _ADCAN19IF // interrupt flag bit
#define ECP13_ADC_IE   _ADCAN19IE // interrupt enable bit
#define ECP13_ADC_IP   _ADCAN19IP // interrupt priority for this analog input
#define ECP13_ADC_RDY  _AN19RDY // ADC buffer ready bit
#define _ECP13_ADC_Interrupt _ADCAN19Interrupt
#define ECP13_INIT_ANALOG	{ECP13_ANSEL = 1; ECP13_WR = PINSTATE_HIGH; ECP13_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP13_INIT_OUTPUT  {ECP13_WR = PINSTATE_LOW; ECP13_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP13_INIT_INPUT   {ECP13_WR = PINSTATE_HIGH; ECP13_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #21 is RD12
#define DBGPIN_TRIS    TRISDbits.TRISD12 // GPIO direction register bit
#define DBGPIN_WR      LATDbits.LATD12 // GPIO port latch register bit
#define DBGPIN_RD      PORTDbits.RD12 // GPIO port register bit
#define DBGPIN_ODC     ODCDbits.ODCD12 // GPIO port open drain configuration register bit
#define DBGPIN_CNPU    CNPUDbits.CNPUD12 // GPIO port pull-up resistor register bit
#define DBGPIN_CNPD    CNPDDbits.CNPDD12 // GPIO port pull-down resistor register bit
#define DBGPIN_CNEN0   CNEN0Dbits.CNEN0D12 // GPIO port change notification Enable register bit
#define DBGPIN_CNSTAT  CNSTATDbits.CNSTATD12 // GPIO port change notification Status register bit
#define DBGPIN_CNEN1   CNEN1Dbits.CNEN1D12 // GPIO port change notification Edge Select Enable register bit
#define DBGPIN_CNF     CNFDbits.CNFD12 // GPIO port change notification flag bit register bit
#define DBGPIN_RP      76 // Number of Remappable Pin
#define DBGPIN_SET     { asm volatile ("bset _LATD, #12 \n"); }
#define DBGPIN_CLEAR   { asm volatile ("bclr _LATD, #12 \n"); }
#define DBGPIN_TOGGLE  { asm volatile ("btg  _LATD, #12 \n"); }
#define DBGPIN_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define DBGPIN_INIT_OUTPUT  {DBGPIN_WR = PINSTATE_LOW; DBGPIN_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define DBGPIN_INIT_INPUT   {DBGPIN_WR = PINSTATE_HIGH; DBGPIN_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #12 is RD13
#define SPI_CS2_TRIS    TRISDbits.TRISD13 // GPIO direction register bit
#define SPI_CS2_WR      LATDbits.LATD13 // GPIO port latch register bit
#define SPI_CS2_RD      PORTDbits.RD13 // GPIO port register bit
#define SPI_CS2_ODC     ODCDbits.ODCD13 // GPIO port open drain configuration register bit
#define SPI_CS2_CNPU    CNPUDbits.CNPUD13 // GPIO port pull-up resistor register bit
#define SPI_CS2_CNPD    CNPDDbits.CNPDD13 // GPIO port pull-down resistor register bit
#define SPI_CS2_CNEN0   CNEN0Dbits.CNEN0D13 // GPIO port change notification Enable register bit
#define SPI_CS2_CNSTAT  CNSTATDbits.CNSTATD13 // GPIO port change notification Status register bit
#define SPI_CS2_CNEN1   CNEN1Dbits.CNEN1D13 // GPIO port change notification Edge Select Enable register bit
#define SPI_CS2_CNF     CNFDbits.CNFD13 // GPIO port change notification flag bit register bit
#define SPI_CS2_RP      77 // Number of Remappable Pin
#define SPI_CS2_SET     { asm volatile ("bset _LATD, #13 \n"); }
#define SPI_CS2_CLEAR   { asm volatile ("bclr _LATD, #13 \n"); }
#define SPI_CS2_TOGGLE  { asm volatile ("btg  _LATD, #13 \n"); }
#define SPI_CS2_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define SPI_CS2_ANSEL   _ANSELD13 // analog/digital pin configuration register bit
#define SPI_CS2_ADCCORE  // index starts from zero, last index indicated shared adC core
#define SPI_CS2_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define SPI_CS2_ADC_AN_INPUT N2   // ANx input pin number
#define SPI_CS2_ADCBUF  ADCBUFN2 // ADC buffer register for this input
#define SPI_CS2_ADC_ANIE ADIEHbits.IEN2
#define SPI_CS2_ADC_ANEIE ADEIEHbits.EIENN2
#define SPI_CS2_ADC_IF   _ADCANN2IF // interrupt flag bit
#define SPI_CS2_ADC_IE   _ADCANN2IE // interrupt enable bit
#define SPI_CS2_ADC_IP   _ADCANN2IP // interrupt priority for this analog input
#define SPI_CS2_ADC_RDY  _ANN2RDY // ADC buffer ready bit
#define _SPI_CS2_ADC_Interrupt _ADCANN2Interrupt
#define SPI_CS2_INIT_ANALOG	{SPI_CS2_ANSEL = 1; SPI_CS2_WR = PINSTATE_HIGH; SPI_CS2_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define SPI_CS2_INIT_OUTPUT  {SPI_CS2_WR = PINSTATE_LOW; SPI_CS2_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SPI_CS2_INIT_INPUT   {SPI_CS2_WR = PINSTATE_HIGH; SPI_CS2_TRIS = PINDIR_INPUT;} // initialization macro for digital input

