areiter128/USB-PD-BoB/h/mcal/config/MA330048_P33CK_R30_USB_PD_BOB_pinmap.h
// Device Pin #11 is RD14
#define ECP26_TRIS    TRISDbits.TRISD14 // GPIO direction register bit
#define ECP26_WR      LATDbits.LATD14 // GPIO port latch register bit
#define ECP26_RD      PORTDbits.RD14 // GPIO port register bit
#define ECP26_ODC     ODCDbits.ODCD14 // GPIO port open drain configuration register bit
#define ECP26_CNPU    CNPUDbits.CNPUD14 // GPIO port pull-up resistor register bit
#define ECP26_CNPD    CNPDDbits.CNPDD14 // GPIO port pull-down resistor register bit
#define ECP26_CNEN0   CNEN0Dbits.CNEN0D14 // GPIO port change notification Enable register bit
#define ECP26_CNSTAT  CNSTATDbits.CNSTATD14 // GPIO port change notification Status register bit
#define ECP26_CNEN1   CNEN1Dbits.CNEN1D14 // GPIO port change notification Edge Select Enable register bit
#define ECP26_CNF     CNFDbits.CNFD14 // GPIO port change notification flag bit register bit
#define ECP26_RP      78 // Number of Remappable Pin
#define ECP26_SET     { asm volatile ("bset _LATD, #14 \n"); }
#define ECP26_CLEAR   { asm volatile ("bclr _LATD, #14 \n"); }
#define ECP26_TOGGLE  { asm volatile ("btg  _LATD, #14 \n"); }
#define ECP26_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP26_INIT_OUTPUT  {ECP26_WR = PINSTATE_LOW; ECP26_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP26_INIT_INPUT   {ECP26_WR = PINSTATE_HIGH; ECP26_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #8 is RD15
#define DBGLED_TRIS    TRISDbits.TRISD15 // GPIO direction register bit
#define DBGLED_WR      LATDbits.LATD15 // GPIO port latch register bit
#define DBGLED_RD      PORTDbits.RD15 // GPIO port register bit
#define DBGLED_ODC     ODCDbits.ODCD15 // GPIO port open drain configuration register bit
#define DBGLED_CNPU    CNPUDbits.CNPUD15 // GPIO port pull-up resistor register bit
#define DBGLED_CNPD    CNPDDbits.CNPDD15 // GPIO port pull-down resistor register bit
#define DBGLED_CNEN0   CNEN0Dbits.CNEN0D15 // GPIO port change notification Enable register bit
#define DBGLED_CNSTAT  CNSTATDbits.CNSTATD15 // GPIO port change notification Status register bit
#define DBGLED_CNEN1   CNEN1Dbits.CNEN1D15 // GPIO port change notification Edge Select Enable register bit
#define DBGLED_CNF     CNFDbits.CNFD15 // GPIO port change notification flag bit register bit
#define DBGLED_RP      79 // Number of Remappable Pin
#define DBGLED_SET     { asm volatile ("bset _LATD, #15 \n"); }
#define DBGLED_CLEAR   { asm volatile ("bclr _LATD, #15 \n"); }
#define DBGLED_TOGGLE  { asm volatile ("btg  _LATD, #15 \n"); }
#define DBGLED_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define DBGLED_INIT_OUTPUT  {DBGLED_WR = PINSTATE_LOW; DBGLED_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define DBGLED_INIT_INPUT   {DBGLED_WR = PINSTATE_HIGH; DBGLED_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #58 is RD2
#define ECP39_TRIS    TRISDbits.TRISD2 // GPIO direction register bit
#define ECP39_WR      LATDbits.LATD2 // GPIO port latch register bit
#define ECP39_RD      PORTDbits.RD2 // GPIO port register bit
#define ECP39_ODC     ODCDbits.ODCD2 // GPIO port open drain configuration register bit
#define ECP39_CNPU    CNPUDbits.CNPUD2 // GPIO port pull-up resistor register bit
#define ECP39_CNPD    CNPDDbits.CNPDD2 // GPIO port pull-down resistor register bit
#define ECP39_CNEN0   CNEN0Dbits.CNEN0D2 // GPIO port change notification Enable register bit
#define ECP39_CNSTAT  CNSTATDbits.CNSTATD2 // GPIO port change notification Status register bit
#define ECP39_CNEN1   CNEN1Dbits.CNEN1D2 // GPIO port change notification Edge Select Enable register bit
#define ECP39_CNF     CNFDbits.CNFD2 // GPIO port change notification flag bit register bit
#define ECP39_RP      66 // Number of Remappable Pin
#define ECP39_SET     { asm volatile ("bset _LATD, #2 \n"); }
#define ECP39_CLEAR   { asm volatile ("bclr _LATD, #2 \n"); }
#define ECP39_TOGGLE  { asm volatile ("btg  _LATD, #2 \n"); }
#define ECP39_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP39_INIT_OUTPUT  {ECP39_WR = PINSTATE_LOW; ECP39_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP39_INIT_INPUT   {ECP39_WR = PINSTATE_HIGH; ECP39_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #55 is RD3
#define UART_TX_TRIS    TRISDbits.TRISD3 // GPIO direction register bit
#define UART_TX_WR      LATDbits.LATD3 // GPIO port latch register bit
#define UART_TX_RD      PORTDbits.RD3 // GPIO port register bit
#define UART_TX_ODC     ODCDbits.ODCD3 // GPIO port open drain configuration register bit
#define UART_TX_CNPU    CNPUDbits.CNPUD3 // GPIO port pull-up resistor register bit
#define UART_TX_CNPD    CNPDDbits.CNPDD3 // GPIO port pull-down resistor register bit
#define UART_TX_CNEN0   CNEN0Dbits.CNEN0D3 // GPIO port change notification Enable register bit
#define UART_TX_CNSTAT  CNSTATDbits.CNSTATD3 // GPIO port change notification Status register bit
#define UART_TX_CNEN1   CNEN1Dbits.CNEN1D3 // GPIO port change notification Edge Select Enable register bit
#define UART_TX_CNF     CNFDbits.CNFD3 // GPIO port change notification flag bit register bit
#define UART_TX_RP      PPS_RPO67  // Number of Remappable Pin
#define UART_TX_SET     { asm volatile ("bset _LATD, #3 \n"); }
#define UART_TX_CLEAR   { asm volatile ("bclr _LATD, #3 \n"); }
#define UART_TX_TOGGLE  { asm volatile ("btg  _LATD, #3 \n"); }
#define UART_TX_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define UART_TX_INIT_OUTPUT  {UART_TX_WR = PINSTATE_LOW; UART_TX_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define UART_TX_INIT_INPUT   {UART_TX_WR = PINSTATE_HIGH; UART_TX_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #54 is RD4
#define UART_RX_TRIS    TRISDbits.TRISD4 // GPIO direction register bit
#define UART_RX_WR      LATDbits.LATD4 // GPIO port latch register bit
#define UART_RX_RD      PORTDbits.RD4 // GPIO port register bit
#define UART_RX_ODC     ODCDbits.ODCD4 // GPIO port open drain configuration register bit
#define UART_RX_CNPU    CNPUDbits.CNPUD4 // GPIO port pull-up resistor register bit
#define UART_RX_CNPD    CNPDDbits.CNPDD4 // GPIO port pull-down resistor register bit
#define UART_RX_CNEN0   CNEN0Dbits.CNEN0D4 // GPIO port change notification Enable register bit
#define UART_RX_CNSTAT  CNSTATDbits.CNSTATD4 // GPIO port change notification Status register bit
#define UART_RX_CNEN1   CNEN1Dbits.CNEN1D4 // GPIO port change notification Edge Select Enable register bit
#define UART_RX_CNF     CNFDbits.CNFD4 // GPIO port change notification flag bit register bit
#define UART_RX_RP      68 // Number of Remappable Pin
#define UART_RX_SET     { asm volatile ("bset _LATD, #4 \n"); }
#define UART_RX_CLEAR   { asm volatile ("bclr _LATD, #4 \n"); }
#define UART_RX_TOGGLE  { asm volatile ("btg  _LATD, #4 \n"); }
#define UART_RX_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define UART_RX_INIT_OUTPUT  {UART_RX_WR = PINSTATE_LOW; UART_RX_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define UART_RX_INIT_INPUT   {UART_RX_WR = PINSTATE_HIGH; UART_RX_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #44 is RD5
#define ECP34_TRIS    TRISDbits.TRISD5 // GPIO direction register bit
#define ECP34_WR      LATDbits.LATD5 // GPIO port latch register bit
#define ECP34_RD      PORTDbits.RD5 // GPIO port register bit
#define ECP34_ODC     ODCDbits.ODCD5 // GPIO port open drain configuration register bit
#define ECP34_CNPU    CNPUDbits.CNPUD5 // GPIO port pull-up resistor register bit
#define ECP34_CNPD    CNPDDbits.CNPDD5 // GPIO port pull-down resistor register bit
#define ECP34_CNEN0   CNEN0Dbits.CNEN0D5 // GPIO port change notification Enable register bit
#define ECP34_CNSTAT  CNSTATDbits.CNSTATD5 // GPIO port change notification Status register bit
#define ECP34_CNEN1   CNEN1Dbits.CNEN1D5 // GPIO port change notification Edge Select Enable register bit
#define ECP34_CNF     CNFDbits.CNFD5 // GPIO port change notification flag bit register bit
#define ECP34_RP      69 // Number of Remappable Pin
#define ECP34_SET     { asm volatile ("bset _LATD, #5 \n"); }
#define ECP34_CLEAR   { asm volatile ("bclr _LATD, #5 \n"); }
#define ECP34_TOGGLE  { asm volatile ("btg  _LATD, #5 \n"); }
#define ECP34_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP34_INIT_OUTPUT  {ECP34_WR = PINSTATE_LOW; ECP34_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP34_INIT_INPUT   {ECP34_WR = PINSTATE_HIGH; ECP34_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #43 is RD6
#define ECP36_TRIS    TRISDbits.TRISD6 // GPIO direction register bit
#define ECP36_WR      LATDbits.LATD6 // GPIO port latch register bit
#define ECP36_RD      PORTDbits.RD6 // GPIO port register bit
#define ECP36_ODC     ODCDbits.ODCD6 // GPIO port open drain configuration register bit
#define ECP36_CNPU    CNPUDbits.CNPUD6 // GPIO port pull-up resistor register bit
#define ECP36_CNPD    CNPDDbits.CNPDD6 // GPIO port pull-down resistor register bit
#define ECP36_CNEN0   CNEN0Dbits.CNEN0D6 // GPIO port change notification Enable register bit
#define ECP36_CNSTAT  CNSTATDbits.CNSTATD6 // GPIO port change notification Status register bit
#define ECP36_CNEN1   CNEN1Dbits.CNEN1D6 // GPIO port change notification Edge Select Enable register bit
#define ECP36_CNF     CNFDbits.CNFD6 // GPIO port change notification flag bit register bit
#define ECP36_RP      70 // Number of Remappable Pin
#define ECP36_SET     { asm volatile ("bset _LATD, #6 \n"); }
#define ECP36_CLEAR   { asm volatile ("bclr _LATD, #6 \n"); }
#define ECP36_TOGGLE  { asm volatile ("btg  _LATD, #6 \n"); }
#define ECP36_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP36_INIT_OUTPUT  {ECP36_WR = PINSTATE_LOW; ECP36_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP36_INIT_INPUT   {ECP36_WR = PINSTATE_HIGH; ECP36_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #42 is RD7
#define ECP50_TRIS    TRISDbits.TRISD7 // GPIO direction register bit
#define ECP50_WR      LATDbits.LATD7 // GPIO port latch register bit
#define ECP50_RD      PORTDbits.RD7 // GPIO port register bit
#define ECP50_ODC     ODCDbits.ODCD7 // GPIO port open drain configuration register bit
#define ECP50_CNPU    CNPUDbits.CNPUD7 // GPIO port pull-up resistor register bit
#define ECP50_CNPD    CNPDDbits.CNPDD7 // GPIO port pull-down resistor register bit
#define ECP50_CNEN0   CNEN0Dbits.CNEN0D7 // GPIO port change notification Enable register bit
#define ECP50_CNSTAT  CNSTATDbits.CNSTATD7 // GPIO port change notification Status register bit
#define ECP50_CNEN1   CNEN1Dbits.CNEN1D7 // GPIO port change notification Edge Select Enable register bit
#define ECP50_CNF     CNFDbits.CNFD7 // GPIO port change notification flag bit register bit
#define ECP50_RP      71 // Number of Remappable Pin
#define ECP50_SET     { asm volatile ("bset _LATD, #7 \n"); }
#define ECP50_CLEAR   { asm volatile ("bclr _LATD, #7 \n"); }
#define ECP50_TOGGLE  { asm volatile ("btg  _LATD, #7 \n"); }
#define ECP50_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP50_INIT_OUTPUT  {ECP50_WR = PINSTATE_LOW; ECP50_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP50_INIT_INPUT   {ECP50_WR = PINSTATE_HIGH; ECP50_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #39 is RD8
#define SPI_MOSI_TRIS    TRISDbits.TRISD8 // GPIO direction register bit
#define SPI_MOSI_WR      LATDbits.LATD8 // GPIO port latch register bit
#define SPI_MOSI_RD      PORTDbits.RD8 // GPIO port register bit
#define SPI_MOSI_ODC     ODCDbits.ODCD8 // GPIO port open drain configuration register bit
#define SPI_MOSI_CNPU    CNPUDbits.CNPUD8 // GPIO port pull-up resistor register bit
#define SPI_MOSI_CNPD    CNPDDbits.CNPDD8 // GPIO port pull-down resistor register bit
#define SPI_MOSI_CNEN0   CNEN0Dbits.CNEN0D8 // GPIO port change notification Enable register bit
#define SPI_MOSI_CNSTAT  CNSTATDbits.CNSTATD8 // GPIO port change notification Status register bit
#define SPI_MOSI_CNEN1   CNEN1Dbits.CNEN1D8 // GPIO port change notification Edge Select Enable register bit
#define SPI_MOSI_CNF     CNFDbits.CNFD8 // GPIO port change notification flag bit register bit
#define SPI_MOSI_RP      72 // Number of Remappable Pin
#define SPI_MOSI_SET     { asm volatile ("bset _LATD, #8 \n"); }
#define SPI_MOSI_CLEAR   { asm volatile ("bclr _LATD, #8 \n"); }
#define SPI_MOSI_TOGGLE  { asm volatile ("btg  _LATD, #8 \n"); }
#define SPI_MOSI_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define SPI_MOSI_INIT_OUTPUT  {SPI_MOSI_WR = PINSTATE_LOW; SPI_MOSI_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SPI_MOSI_INIT_INPUT   {SPI_MOSI_WR = PINSTATE_HIGH; SPI_MOSI_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #38 is RD9
#define ECP28_TRIS    TRISDbits.TRISD9 // GPIO direction register bit
#define ECP28_WR      LATDbits.LATD9 // GPIO port latch register bit
#define ECP28_RD      PORTDbits.RD9 // GPIO port register bit
#define ECP28_ODC     ODCDbits.ODCD9 // GPIO port open drain configuration register bit
#define ECP28_CNPU    CNPUDbits.CNPUD9 // GPIO port pull-up resistor register bit
#define ECP28_CNPD    CNPDDbits.CNPDD9 // GPIO port pull-down resistor register bit
#define ECP28_CNEN0   CNEN0Dbits.CNEN0D9 // GPIO port change notification Enable register bit
#define ECP28_CNSTAT  CNSTATDbits.CNSTATD9 // GPIO port change notification Status register bit
#define ECP28_CNEN1   CNEN1Dbits.CNEN1D9 // GPIO port change notification Edge Select Enable register bit
#define ECP28_CNF     CNFDbits.CNFD9 // GPIO port change notification flag bit register bit
#define ECP28_RP      73 // Number of Remappable Pin
#define ECP28_SET     { asm volatile ("bset _LATD, #9 \n"); }
#define ECP28_CLEAR   { asm volatile ("bclr _LATD, #9 \n"); }
#define ECP28_TOGGLE  { asm volatile ("btg  _LATD, #9 \n"); }
#define ECP28_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP28_INIT_OUTPUT  {ECP28_WR = PINSTATE_LOW; ECP28_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP28_INIT_INPUT   {ECP28_WR = PINSTATE_HIGH; ECP28_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #10 is VDD

// Device Pin #25 is VDD

// Device Pin #41 is VDD

// Device Pin #57 is VDD

// Device Pin #9 is VSS

// Device Pin #26 is VSS

// Device Pin #40 is VSS

// Device Pin #56 is VSS



#endif	/* __MA330048_P33CK_USB_PD_BOB_R30_PINMAP_H__ */
